/* OID.strings
/*
/* This file maps object identifiers (OIDs) to their corresponding labels.
/* These labels are used when displaying the details of a certificate's contents.
/*
/* NOTE TO LOCALIZERS:
/*
/* All strings in this file should eventually be localized. However, not all of them are
/* currently localizable. Specifically, there are a number of acronymns and abbreviations
/* which still need to be expanded into the corresponding English words. [3751398]
/*
/* Acronymns, such as "RSA," "DES," "X.509," "S/MIME," and so on, should be left alone for now.
/* Abbreviated labels such as "id-aa-dvcs-dvc" should also not be localized if present.


/* Deutsche Telekom */

"06 05 02 82 06 01 0A"			= "Telesec";
"06 06 02 82 06 01 0A 00"		= "ملحق Telesec";
"06 06 02 82 06 01 0A 01"		= "تقنية Telesec";

"06 07 02 82 06 01 0A 01 00"	= "مصادقة Telesec";
"06 08 02 82 06 01 0A 01 00 01"	= "مصادقة كلمة السر";
"06 08 02 82 06 01 0A 01 00 02" = "مصادقة كلمة السر المحمية";
"06 08 02 82 06 01 0A 01 00 03" = "مصادقة One-Way X.509";
"06 08 02 82 06 01 0A 01 00 04" = "مصادقة ثنائية الاتجاه X.509";
"06 08 02 82 06 01 0A 01 00 05" = "مصادقة ثلاثية الاتجاه X.509";
"06 08 02 82 06 01 0A 01 00 06" = "مصادقة One-Way ISO9798";
"06 08 02 82 06 01 0A 01 00 07" = "مصادقة ثنائية الاتجاه ISO9798";
"06 08 02 82 06 01 0A 01 00 08" = "مصادقة Telekom";

"06 07 02 82 06 01 0A 01 01"	= "توقيع Telesec";
"06 08 02 82 06 01 0A 01 01 01"	= "MD4 مع RSA و ISO9697";
"06 08 02 82 06 01 0A 01 01 02"	= "معيار توقيع MD4 مع RSA و Telesec";
"06 08 02 82 06 01 0A 01 01 03"	= "MD5 مع RSA و ISO9697";
"06 08 02 82 06 01 0A 01 01 04"	= "معيار توقيع MD5 مع RSA و Telesec";
"06 08 02 82 06 01 0A 01 01 05"	= "معيار توقيع RIPEMD-160 مع RSA و Telekom";
"06 08 02 82 06 01 0A 01 01 09"	= "توقيع HBCI RSA";

"06 07 02 82 06 01 0A 01 02"	= "تشفير Telesec";
"06 08 02 82 06 01 0A 01 02 00"	= "لا شيء";
"06 08 02 82 06 01 0A 01 02 01"	= "RSA Telesec";
"06 08 02 82 06 01 0A 01 02 02"	= "DES";
"06 09 02 82 06 01 0A 01 02 02 01"	= "DES ECB
";
"06 09 02 82 06 01 0A 01 02 02 02"	= "DES CBC
";
"06 09 02 82 06 01 0A 01 02 02 03"	= "DES OFB
";
"06 09 02 82 06 01 0A 01 02 02 04"	= "DES CFB8
";
"06 09 02 82 06 01 0A 01 02 02 05"	= "DES CFB64
";
"06 08 02 82 06 01 0A 01 02 03"	= "3DES";
"06 09 02 82 06 01 0A 01 02 03 01"	= "3DES ECB";
"06 09 02 82 06 01 0A 01 02 03 02"	= "3DES CBC";
"06 09 02 82 06 01 0A 01 02 03 03"	= "3DES OFB
";
"06 09 02 82 06 01 0A 01 02 03 04"	= "3DES CFB8
";
"06 09 02 82 06 01 0A 01 02 03 05"	= "3DES CFB64";
"06 08 02 82 06 01 0A 01 02 04"	= "Magenta";
"06 08 02 82 06 01 0A 01 02 05"	= "IDEA";
"06 09 02 82 06 01 0A 01 02 05 01"	= "IDEA ECB
";
"06 09 02 82 06 01 0A 01 02 05 02"	= "IDEA CBC
";
"06 09 02 82 06 01 0A 01 02 05 03"	= "IDEA OFB
";
"06 09 02 82 06 01 0A 01 02 05 04"	= "IDEA CFB8
";
"06 09 02 82 06 01 0A 01 02 05 05"	= "IDEA CFB64
";

"06 07 02 82 06 01 0A 01 03"	= "وظيفة باتجاه واحد";
"06 08 02 82 06 01 0A 01 03 01"	= "MD4";
"06 08 02 82 06 01 0A 01 03 02"	= "MD5";
"06 08 02 82 06 01 0A 01 03 03"	= "SqModN-X509";
"06 08 02 82 06 01 0A 01 03 04"	= "SqModN-ISO";
"06 08 02 82 06 01 0A 01 03 05"	= "RIPEMD-128
";
"06 08 02 82 06 01 0A 01 03 06"	= "التجزئة بواسطة حظر الشيفرة";
"06 08 02 82 06 01 0A 01 03 07"	= "MAC";
"06 08 02 82 06 01 0A 01 03 08"	= "RIPEMD-160
";

"06 07 02 82 06 01 0A 01 04"	= "وظيفة FEC";
"06 08 02 82 06 01 0A 01 04 01"	= "Reed Solomon";

"06 06 02 82 06 01 0A 02"		= "وحدة Telesec";
"06 07 02 82 06 01 0A 02 00"	= "خوارزميات";
"06 07 02 82 06 01 0A 02 01"	= "أنواع السمة";
"06 07 02 82 06 01 0A 02 02"	= "أنواع الشهادة";
"06 07 02 82 06 01 0A 02 03"	= "أنواع الرسالة";
"06 07 02 82 06 01 0A 02 04"	= "بروتوكول PL";
"06 07 02 82 06 01 0A 02 05"	= "SME ومكونات من SME";
"06 07 02 82 06 01 0A 02 06"	= "FEC";
"06 07 02 82 06 01 0A 02 07"	= "تعاريف مفيدة";
"06 07 02 82 06 01 0A 02 08"	= "ملفات STE";
"06 07 02 82 06 01 0A 02 09"	= "SAdmin";
"06 07 02 82 06 01 0A 02 0A"	= "الطلب الإلكتروني";
"06 07 02 82 06 01 0A 02 0B"	= "تطبيق غير المتناظر Telesec TTP";
"06 07 02 82 06 01 0A 02 0C"	= "تطبيق الأساس Telesec TTP";
"06 07 02 82 06 01 0A 02 0D"	= "رسائل Telesec TTP";
"06 07 02 82 06 01 0A 02 0E"	= "تطبيق الطابع الزمني Telesec TTP";

"06 06 02 82 06 01 0A 03"		= "صنف كائن";
"06 07 02 82 06 01 0A 03 00"	= "اسم آخر Telesec";
"06 07 02 82 06 01 0A 03 01"	= "دليل";
"06 07 02 82 06 01 0A 03 02"	= "نوع الدليل";
"06 07 02 82 06 01 0A 03 03"	= "مجموعة الدليل";
"06 07 02 82 06 01 0A 03 04"	= "مستخدم الدليل";
"06 07 02 82 06 01 0A 03 05"	= "مفتاح الدخول المتماثل";

"06 06 02 82 06 01 0A 04"		= "الطرد";
"06 06 02 82 06 01 0A 05"		= "مُعامل";
"06 06 02 82 06 01 0A 06"		= "اسم الارتباط";
"06 06 02 82 06 01 0A 07"		= "السمة";
"06 07 02 82 06 01 0A 07 00"	= "معرف مجموعة التطبيق";
"06 07 02 82 06 01 0A 07 01"	= "نوع الشهادة";
"06 07 02 82 06 01 0A 07 02"	= "شهادة Telesec";
"06 07 02 82 06 01 0A 07 03"	= "رقم الشهادة";
"06 07 02 82 06 01 0A 07 04"	= "قائمة إلغاء الشهادة";
"06 07 02 82 06 01 0A 07 05"	= "تاريخ الإنشاء";
"06 07 02 82 06 01 0A 07 06"	= "المصدر";
"06 07 02 82 06 01 0A 07 07"	= "سلطة التسمية";
"06 07 02 82 06 01 0A 07 08"	= "دليل مفتاح العمومي";
"06 07 02 82 06 01 0A 07 09"	= "نطاق الأمن";
"06 07 02 82 06 01 0A 07 0A"	= "الموضوع";
"06 07 02 82 06 01 0A 07 0B"	= "وقت الإلغاء";
"06 07 02 82 06 01 0A 07 0C"	= "مرجعية مجموعة المستخدم";
"06 07 02 82 06 01 0A 07 0D"	= "صلاحية";
"06 07 02 82 06 01 0A 07 0E"	= "ZERT93";
"06 07 02 82 06 01 0A 07 0F"	= "بيئة رسالة الأمن";
"06 07 02 82 06 01 0A 07 10"	= "دليل مفتاح العمومي مجهول المصدر";
"06 07 02 82 06 01 0A 07 11"	= "اسم معطى Telesec";
"06 07 02 82 06 01 0A 07 12"	= "اسم الإضافات";
"06 07 02 82 06 01 0A 07 13"	= "الرمز البريدي لـ Telesec";
"06 07 02 82 06 01 0A 07 14"	= "اسم المميز";
"06 07 02 82 06 01 0A 07 15"	= "قائمة شهادة Telesec";
"06 07 02 82 06 01 0A 07 16"	= "قائمة شهادة Teletrust";
"06 07 02 82 06 01 0A 07 17"	= "قائمة شهادة X.509";
"06 07 02 82 06 01 0A 07 18"	= "وقت الإصدار";
"06 07 02 82 06 01 0A 07 19"	= "رقم البطاقة الحقيقية";
"06 07 02 82 06 01 0A 07 1A"	= "نوع الملف";
"06 07 02 82 06 01 0A 07 1B"	= "ملف Ctl هو أرشيف";
"06 07 02 82 06 01 0A 07 1C"	= "عنوان البريد الإلكتروني";
"06 07 02 82 06 01 0A 07 1D"	= "قائمة نموذج الشهادة";
"06 07 02 82 06 01 0A 07 1E"	= "اسم الدليل";
"06 07 02 82 06 01 0A 07 1F"	= "اسم نوع الدليل";
"06 07 02 82 06 01 0A 07 20"	= "اسم مجموعة الدليل";
"06 07 02 82 06 01 0A 07 21"	= "اسم مستخدم الدليل";
"06 07 02 82 06 01 0A 07 22"	= "علم الإلغاء";
"06 07 02 82 06 01 0A 07 23"	= "اسم مفتاح الدخول المتماثل";
"06 07 02 82 06 01 0A 07 24"	= "رقم GL";
"06 07 02 82 06 01 0A 07 25"	= "رقم GO";
"06 07 02 82 06 01 0A 07 26"	= "بيانات مفتاح G";
"06 07 02 82 06 01 0A 07 27"	= "بيانات مفتاح Z";
"06 07 02 82 06 01 0A 07 28"	= "بيانات مفتاح KT";
"06 07 02 82 06 01 0A 07 2A"	= "رقم مفتاح KT";
"06 07 02 82 06 01 0A 07 33"	= "وقت توليد الإلغاء";
"06 07 02 82 06 01 0A 07 34"	= "نص المسؤولية";

"06 06 02 82 06 01 0A 08"		= "مجموعة السمة";
"06 06 02 82 06 01 0A 09"		= "إجراء";
"06 06 02 82 06 01 0A 0A"		= "إشعار";
"06 06 02 82 06 01 0A 0B"		= "SNMP-MIBS";

"06 07 02 82 06 01 0A 0B 01"	= "تطبيق الأمن";

"06 06 02 82 06 01 0A 0C"		= "تعاريف شهادة وملحق CRL";

"06 07 02 82 06 01 0A 0C 00"	= "Cert Extension Liability Limitation Extension";
"06 07 02 82 06 01 0A 0C 01"	= "ملحق هوية شهادة Telesec";
"06 07 02 82 06 01 0A 0C 02"	= "معرف سياسة Telesec";
"06 07 02 82 06 01 0A 0C 03"	= "هوية مؤهل سياسة Telesec";
"06 07 02 82 06 01 0A 0C 04"	= "ملحق تصفية Telesec CRL";
"06 07 02 82 06 01 0A 0C 05"	= "ملحق تصفية Telesec CRL";
"06 07 02 82 06 01 0A 0C 06"	= "ملحق سلطة تسمية Telesec";

/* RFC 1274 (X.500 attribute collection from the UK, thus the weird OID). */

"06 0A 09 92 26 89 93 F2 2C 64 01 01"	= "هوية المستخدم";
"06 0A 09 92 26 89 93 F2 2C 64 01 03"	= "صندوق بريد RFC822";

/* RFC 2247 */

"06 0A 09 92 26 89 93 F2 2C 64 01 19"	= "عنصر المجال";

/* Australian Government */

"06 06 2A 24 01 82 4D 01"   = "رقم العمل الأسترالي";

/* Certificates Australia */

"06 0A 2A 24 A4 97 A3 53 01 64 01 01"	= "معرف سياسة شهادات أستراليا";

/* Signet */

"06 09 2A 24 A0 F2 A0 7D 01 01 02"	= "شخصي Signet";
"06 09 2A 24 A0 F2 A0 7D 01 01 03"	= "عمل Signet";
"06 09 2A 24 A0 F2 A0 7D 01 01 04"	= "قانوني Signet";
"06 09 2A 24 A0 F2 A0 7D 01 01 0A"	= "Signet Pilot";
"06 09 2A 24 A0 F2 A0 7D 01 01 0B"	= "Signet IntraNet";
"06 09 2A 24 A0 F2 A0 7D 01 01 14"	= "معرف سياسة Signet";

/* Mitsubishi */

"06 0B 2A 83 08 8C 1A 4B 3D 01 01 01"		= "خوارزمية تشفير متماثلة";
"06 0C 2A 83 08 8C 9A 4B 3D 01 01 01 01"	= "MISTY1-CBC";

/* SEIS */

"06 05 2A 85 70 22 01"		= "SEIS CP";
"06 06 2A 85 70 22 01 01"	= "معرف سياسة SEIS عالي التأكيد";
"06 06 2A 85 70 22 01 02"	= "معرف سياسة SEIS GAK";
"06 05 2A 85 70 22 02"		= "SEIS PE";
"06 05 2A 85 70 22 03"		= "SEIS AT";
"06 06 2A 85 70 22 03 01"	= "معرف شخصي SEIS AT";

/* ANSI X9.57 */

"06 06 2A 86 48 CE 38 01"		= "وحدة ANSI X9.57";
"06 07 2A 86 48 CE 38 01 01"	= "إدارة شهادة X9F1";
"06 06 2A 86 48 CE 38 02"		= "أمر تعليق";
"06 07 2A 86 48 CE 38 02 01"	= "أمر التعليق- لا يوجد";
"06 07 2A 86 48 CE 38 02 02"	= "الاتصال بالمصدر";
"06 07 2A 86 48 CE 38 02 03"	= "رفض";
"06 07 2A 86 48 CE 38 02 04"	= "رمز الإلتقاط";
"06 06 2A 86 48 CE 38 03"		= "السمة";
"06 06 2A 86 48 CE 38 03 01"	= "Countersignature";
"06 06 2A 86 48 CE 38 03 02"	= "شهادة السمة";
"06 06 2A 86 48 CE 38 04"		= "خوارزمية";
"06 07 2A 86 48 CE 38 04 01"	= "DSA";
"06 07 2A 86 48 CE 38 04 02"	= "تطابق DSA";
"06 07 2A 86 48 CE 38 04 03"	= "DSA مع SHA-1";

/* ANSI X9.62 */

"06 06 2A 86 48 CE 3D 01"		= "نوع الحقل ANSI X9.62";
"06 07 2A 86 48 CE 3D 01 01"	= "الحقل الأولي";
"06 07 2A 86 48 CE 3D 01 02"	= "حقل العدد البياني-اثنان";
"06 09 2A 86 48 CE 3D 01 02 03"	= "أساس العدد البياني-اثنان";
"06 0A 2A 86 48 CE 3D 01 02 03 01"	= "بلا أساس";
"06 0A 2A 86 48 CE 3D 01 02 03 02"	= "أساس ثلاثي الحدود";
"06 0A 2A 86 48 CE 3D 01 02 03 03"	= "أساس خماسي الحدود";
"06 06 2A 86 48 CE 3D 02"		= "نوع المفتاح العمومي";
"06 07 2A 86 48 CE 3D 02 01"	= "مفتاح عام Elliptic Curve";

/* ANSI X9.42 */

"06 06 2A 86 48 CE 3E 01"		= "نوع الحقل ANSI X9.42";
"06 07 2A 86 48 CE 3E 01 01"	= "حقل Galois الأولي";
"06 06 2A 86 48 CE 3E 02"		= "نوع الرقم";
"06 07 2A 86 48 CE 3E 02 01"	= "مفتاح عام Diffie-Hellman";
"06 06 2A 86 48 CE 3E 03"		= "مخطط";
"06 07 2A 86 48 CE 3E 03 01"	= "Diffie-Hellman ثابت";
"06 07 2A 86 48 CE 3E 03 02"	= "عابر Diffie-Hellman";
"06 07 2A 86 48 CE 3E 03 03"	= "Diffie-Hellman مختلط ١";
"06 07 2A 86 48 CE 3E 03 04"	= "Diffie-Hellman مختلط ٢";
"06 07 2A 86 48 CE 3E 03 05"	= "MQV2";
"06 07 2A 86 48 CE 3E 03 06"	= "MQV1";

/* Nortel Secure Networks/Entrust */

"06 07 2A 86 48 86 F6 7D 07"		= "NSN";
"06 08 2A 86 48 86 F6 7D 07 41"		= "NSN-CE";
"06 09 2A 86 48 86 F6 7D 07 41 00"	= "معلومات إصدار التعهد";
"06 08 2A 86 48 86 F6 7D 07 42"		= "NSN-Alg";
"06 09 2A 86 48 86 F6 7D 07 42 03"	= "CAST3-CBC
";
"06 09 2A 86 48 86 F6 7D 07 42 0A"	= "CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0B"	= "CAST5-MAC";
"06 09 2A 86 48 86 F6 7D 07 42 0C"	= "PBE مع MD5 و CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0D"	= "أساس كلمة السر MAC";
"06 08 2A 86 48 86 F6 7D 07 43"		= "NSN-OC";
"06 09 2A 86 48 86 F6 7D 07 43 0C"	= "مستخدم التعهد";
"06 08 2A 86 48 86 F6 7D 07 44"		= "NSN-AT";
"06 09 2A 86 48 86 F6 7D 07 44 00"	= "معلومات تعهد CA";
"06 09 2A 86 48 86 F6 7D 07 44 0A"	= "شهادة السمة";

/* PKCS #1 */

"06 08 2A 86 48 86 F7 0D 01 01"		= "PKCS-1
";
"06 09 2A 86 48 86 F7 0D 01 01 01"	= "تشفير RSA";
"06 09 2A 86 48 86 F7 0D 01 01 02"	= "تشفير MD2 مع RSA";
"06 09 2A 86 48 86 F7 0D 01 01 03"	= "تشفير MD4 مع RSA";
"06 09 2A 86 48 86 F7 0D 01 01 04"	= "تشفير MD5 مع RSA";
"06 09 2A 86 48 86 F7 0D 01 01 05"	= "تشفير SHA-1 مع RSA";
"06 09 2A 86 48 86 F7 0D 01 01 06"	= "تشفير RSA-OAEP (تعيين)";
"06 09 2A 86 48 86 F7 0D 01 01 07"	= "تشفير RSA-OAEP";
"06 09 2A 86 48 86 F7 0D 01 01 08"	= "RSA-OAEP-MGF";
"06 09 2A 86 48 86 F7 0D 01 01 09"	= "علامة RSA-OAEP المحددة";
"06 09 2A 86 48 86 F7 0D 01 01 0A"	= "توقيع RSA-PSS مع Scheme";
"06 09 2A 86 48 86 F7 0D 01 01 0B"	= "تشفير SHA-256 مع RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0C"	= "تشفير SHA-384 مع RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0D"	= "تشفير SHA-512 مع RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0E"	= "تشفير SHA-224 مع RSA";

/* BSAFE/PKCS #2 (obsolete) */

"06 08 2A 86 48 86 F7 0D 01 02"		= "تشفير BSAFE RSA";

/* PKCS #3 */

"06 08 2A 86 48 86 F7 0D 01 03"		= "PKCS-3
";
"06 09 2A 86 48 86 F7 0D 01 03 01"	= "إتفاقية مفتاح Diffie-Hellman";

/* PKCS #5 */

"06 08 2A 86 48 86 F7 0D 01 05"		= "PKCS-5
";
"06 09 2A 86 48 86 F7 0D 01 05 01"	= "PBE مع MD2 و DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 03"	= "PBE مع MD5 و DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 04"	= "PBE مع MD2 و RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 06"	= "PBE مع MD5 و RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 09"	= "PBE مع MD5 و XOR";
"06 09 2A 86 48 86 F7 0D 01 05 0A"	= "PBE مع SHA و DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 0C"	= "PKCS-5 PBKDF2";
"06 09 2A 86 48 86 F7 0D 01 05 0D"	= "PKCS-5 PBES2";
"06 09 2A 86 48 86 F7 0D 01 05 0E"	= "PKCS-5 PBMAC1";

/* PKCS #7 */

"06 08 2A 86 48 86 F7 0D 01 07"		= "PKCS-7
";
"06 09 2A 86 48 86 F7 0D 01 07 01"	= "بيانات";
"06 09 2A 86 48 86 F7 0D 01 07 02"	= "بيانات مصدقة";
"06 09 2A 86 48 86 F7 0D 01 07 03"	= "بيانات مغلّفة";
"06 09 2A 86 48 86 F7 0D 01 07 04"	= "بيانات موّقعة ومغلّفة";
"06 09 2A 86 48 86 F7 0D 01 07 05"	= "بيانات ملّخصة";
"06 09 2A 86 48 86 F7 0D 01 07 06"	= "بيانات مشفرة";
"06 09 2A 86 48 86 F7 0D 01 07 07"	= "بيانات مع سمات";
"06 09 2A 86 48 86 F7 0D 01 07 08"	= "معلومات المفتاح الخاص المشفرة";

/* PKCS #9 */

"06 08 2A 86 48 86 F7 0D 01 09"		= "PKCS-9";
"06 09 2A 86 48 86 F7 0D 01 09 01"	= "عنوان البريد الإلكتروني";
"06 09 2A 86 48 86 F7 0D 01 09 02"	= "اسم من غير أساس";
"06 09 2A 86 48 86 F7 0D 01 09 03"	= "نوع المحتوى";
"06 09 2A 86 48 86 F7 0D 01 09 04"	= "خلاصة الرسالة";
"06 09 2A 86 48 86 F7 0D 01 09 05"	= "توقيع الزمني";
"06 09 2A 86 48 86 F7 0D 01 09 06"	= "Countersignature";
"06 09 2A 86 48 86 F7 0D 01 09 07"	= "كلمة سر تحدي";
"06 09 2A 86 48 86 F7 0D 01 09 08"	= "عنوان من غير أساس";
"06 09 2A 86 48 86 F7 0D 01 09 09"	= "سمات شهادة الموسعة";
"06 09 2A 86 48 86 F7 0D 01 09 0A"	= "المصدر ورقم التسلسلي";
"06 09 2A 86 48 86 F7 0D 01 09 0B"	= "التحقق من كلمة السر";
"06 09 2A 86 48 86 F7 0D 01 09 0C"	= "مفتاح عمومي";
"06 09 2A 86 48 86 F7 0D 01 09 0D"	= "وصف التوقيع";
"06 09 2A 86 48 86 F7 0D 01 09 0E"	= "طلب الملحق";

/* PKCS #9 for use with S/MIME */

"06 09 2A 86 48 86 F7 0D 01 09 0F"		= "قدرات S/MIME";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 01"	= "بيانات موّقعة مفضلة";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 02"	= "لا يمكن فك تشفير أي";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 03"	= "طلب الفاتورة";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 04"	= "الفاتورة";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 05"	= "تلميحات المحتوى";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 06"	= "تاريخ توسعة قائمة البريد";

"06 09 2A 86 48 86 F7 0D 01 09 10"			= "S/MIME
";

/* S/MIME Modules */

"06 0A 2A 86 48 86 F7 0D 01 09 10 00"		= "وحدات S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 01"	= "صياغة رسالة الترميز";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 02"	= "خدمات الأمن المسند";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 03"	= "معرف كائن S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 04"	= "رسالة S/MIME V3";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 05"	= "توقيع ETS الإلكترونية ٨٨";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 06"	= "توقيع ETS الإلكترونية ٩٧";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 07"	= "سياسة توقيع ETS الإلكترونية ٨٨";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 08"	= "سياسة توقيع ETS الإلكترونية ٩٧";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 09"	= "id-mod-certdist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0A"	= "id-mod-domsec";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0B"	= "id-mod-compress";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0C"	= "id-mod-symkeydist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0D"	= "id-mod-cek-reuse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0E"	= "id-mod-cms-2001
";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0F"	= "id-mod-v1AttrCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 10"	= "id-mod-cmsalg-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 11"	= "id-mod-cms-pwri-88
";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 12"	= "id-mod-cms-pwri-97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 13"	= "id-mod-cms-aes";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 14"	= "id-mod-cms-rsaes-oaep";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 15"	= "id-mod-msg-v3dot1";

/* S/MIME Content Types */

"06 0A 2A 86 48 86 F7 0D 01 09 10 01"		= "أنواع محتوى S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 01"	= "id-ct-receipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 02"	= "id-ct-authData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 03"	= "id-ct-publishCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 04"	= "id-ct-TSTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 05"	= "id-ct-TDTInfo
";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 06"	= "id-ct-contentInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 07"	= "id-ct-DVCSRequestData
";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 08"	= "id-ct-DVCSResponseData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 09"	= "id-ct-compressedData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0A"	= "id-ct-svcp-certValRequest
";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0B"	= "id-ct-svcp-certValResponse
";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0C"	= "id-ct-svcp-valPolRequest
";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0D"	= "id-ct-svcp-valPolResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0E"	= "id-ct-attrCertEncAttrs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0F"	= "id-ct-TSReq";

/* S/MIME Authenticated Attributes */

"06 0A 2A 86 48 86 F7 0D 01 09 10 02"		= "سمات مصادقة S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 01"	= "id-aa-receiptRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 02"	= "id-aa-securityLabel";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 03"	= "id-aa-mlExpandHistory";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 04"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 05"	= "id-aa-msgSigDigest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 06"	= "id-aa-encapContentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 07"	= "id-aa-contentIdentifier
";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 08"	= "id-aa-macValue";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 09"	= "id-aa-equivalentLabels";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0A"	= "id-aa-contentReference
";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0B"	= "id-aa-encrypKeyPref";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0C"	= "id-aa-signingCertificate";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0D"	= "id-aa-smimeEncryptCerts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0E"	= "id-aa-timeStampToken";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0F"	= "id-aa-ets-sigPolicyId";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 10"	= "id-aa-ets-commitmentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 11"	= "id-aa-ets-signerLocation
";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 12"	= "id-aa-ets-signerAttr";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 13"	= "id-aa-ets-otherSigCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 14"	= "id-aa-ets-contentTimestamp
";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 15"	= "id-aa-ets-CertificateRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 16"	= "id-aa-ets-RevocationRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 17"	= "id-aa-ets-certValues
";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 18"	= "id-aa-ets-revocationValues
";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 19"	= "id-aa-ets-escTimeStamp
";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1A"	= "id-aa-ets-certCRLTimestamp
";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1B"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1C"	= "id-aa-signatureType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1D"	= "id-aa-dvcs-dvc";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1E"	= "id-aa-CEKReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1F"	= "id-aa-maxCEKDecrypts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 20"	= "id-aa-KEKDerivationAlg";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 21"	= "id-aa-intendedRecipients";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 22"	= "id-aa-cmc-unsignedData";

/* S/MIME Algorithms */

"06 0A 2A 86 48 86 F7 0D 01 09 10 03"		= "خوارزميات S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 01"	= "id-alg-ESDHwith3DES
";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 02"	= "id-alg-ESDHwithRC2";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 03"	= "id-alg-3DESwrap
";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 04"	= "id-alg-RC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 05"	= "id-alg-ESDH
";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 06"	= "id-alg-CMS3DESwrap
";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 07"	= "id-alg-CMSRC2wrap
";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 08"	= "id-alg-zlib";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 09"	= "id-alg-PWRI-KEK";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0A"	= "id-alg-SSDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0B"	= "id-alg-HMACwith3DESwrap
";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0C"	= "id-alg-HMACwithAESwrap";

/* S/MIME Certificate Distribution */

"06 0A 2A 86 48 86 F7 0D 01 09 10 04"		= "توزيع شهادة S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 04 01"	= "توزيع شهادة LDAP";

/* S/MIME Signature Policy Qualifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 05"		= "مؤهل توقيع سياسة S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 01"	= "id-spq-ets-sqt-uri";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 02"	= "id-spq-ets-sqt-unotice
";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 01"	= "id-cti-ets-proofOfOrigin
";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 02"	= "id-cti-ets-proofOfReceipt
";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 03"	= "id-cti-ets-proofOfDelivery
";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 04"	= "id-cti-ets-proofOfSender";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 05"	= "id-cti-ets-proofOfApproval
";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 06"	= "id-cti-ets-proofOfCreation
";

/* S/MIME Signature Type Identifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 09"		= "توقيع نوع المعرف S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 01"	= "توقيع المُنشئ";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 02"	= "توقيع المجال";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 03"	= "سمات إضافية للتوقيع";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 04"	= "مراجعة التوقيع";

/* S/MIME Capabilities */

"06 0A 2A 86 48 86 F7 0D 01 09 10 0B"		= "قدرات S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 0B 01"	= "الثتائي المفضل بالداخل";

/* PKCS #9 for use with PKCS #12 */

"06 09 2A 86 48 86 F7 0D 01 09 14"			= "اسم سهل (ل PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 15"			= "هوية المفتاح المحلي (ل PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 16"			= "أنواع الشهادة (ل PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 01"		= "شهادة X.509 (ل PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 02"		= "شهادة SDSI (ل PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 17"			= "أنواع CRL (ل PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 17 01"		= "X.509 CRL (for PKCS-12)";

/* PKCS #12 */

"06 08 2A 86 48 86 F7 0D 01 0C"				= "صياغة تبادل المعلومات الخاصة PKCS-12";
"06 09 2A 86 48 86 F7 0D 01 0C 01"			= "هويات تشفير أساس كلمة السر PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 01"		= "PBE مع SHA-1 و 128-بت RC4";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 02"		= "PBE مع SHA-1 و 40-بت RC4";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 03"		= "PBE مع SHA-1 و 3-Key Triple DES-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 04"		= "PBE مع SHA-1 و 2-Key Triple DES-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 05"		= "PBE مع SHA-1 و 128-بت RC2-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 06"		= "PBE مع SHA-1 و 40-بت RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 0C 02"			= "هويات PKCS-12 ESPVK";
"06 0A 2A 86 48 86 F7 0D 01 0C 02 01"		= "غطاء مفتاح PKCS-12 PKCS-8 Key";
"06 09 2A 86 48 86 F7 0D 01 0C 03"			= "هويات حقيبة PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 01"		= "هوية حقيبة مفتاح PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 02"		= "شهادة PKCS-12 وهوية حقيبة CRL";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 03"		= "هوية حقيبة سر PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 04"		= "هوية محتوى أمن PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 05"		= "هوية حقيبة مفتاح PKCS-12 PKCS-8 المغطى";
"06 09 2A 86 48 86 F7 0D 01 0C 04"			= "هوية حقيبة شهادة PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 01"		= "شهادة PKCS-12 X.509 وهوية حقيبة CRL";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 02"		= "هوية حقيبة شهادة PKCS-12 SDSI";

"06 09 2A 86 48 86 F7 0D 01 0C 05"			= "PKCS-12 OID";
"06 0A 2A 86 48 86 F7 0D 01 0C 05 01"		= "هوية تشفير أساس كلمة السر PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 01"	= "PKCS-12 مع SHA-1 و 128-Bit RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 02"	= "PKCS-12 مع SHA-1 و 40-Bit RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 03"	= "PKCS-12 PBE مع SHA-1 و Triple DES-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 04"	= "PKCS-12 مع SHA-1 و 128-Bit RC2-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 05"	= "PKCS-12 مع SHA-1 و 40-Bit RC2-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 06"	= "PKCS-12 PBE مع SHA-1 و RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 07"	= "PKCS-12 PBE مع SHA-1 و RC2-CBC";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 02"		= "هويات تغطية PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 01"	= "تشفير PKCS-12 RSA مع 128-Bit RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 02"	= "تشفير PKCS-12 RSA مع 40-Bit RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 03"	= "تشفير PKCS-12 RSA مع Triple DES";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 03"		= "معرف توقيع PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 03 01"	= "خلاصة توقيع PKCS-12 RSA مع SHA-1";

"06 09 2A 86 48 86 F7 0D 01 0C 0A"			= "إصدار PKCS-12 ١";
"06 0A 2A 86 48 86 F7 0D 01 0C 0A 01"		= "هويات حقيبة PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 01"	= "حقيبة مفتاح PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 02"	= "حقيبة مفتاح PKCS-12 PKCS-8 المغطى";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 03"	= "حقيبة شهادة PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 04"	= "حقيبة PKCS-12 CRL";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 05"	= "حقيبة سر PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 06"	= "حقيبة محتوى أمن PKCS-12";

/* PKCS #15 */

"06 09 2A 86 48 86 F7 0D 01 0F 01"		= "وحدات PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 02"		= "سمات PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 03"		= "نوع محتوى PKCS-15";
"06 0A 2A 86 48 86 F7 0D 01 0F 03 01"	= "محتوى PKCS-15";

/* RSADSI digest algorithms */

"06 08 2A 86 48 86 F7 0D 02"			= "خوارزمية خلاصة RSADSI";
"06 08 2A 86 48 86 F7 0D 02 02"			= "MD2";
"06 08 2A 86 48 86 F7 0D 02 04"			= "MD4";
"06 08 2A 86 48 86 F7 0D 02 05"			= "MD5";
"06 08 2A 86 48 86 F7 0D 02 07"			= "HMAC مع SHA-1";

/* RSADSI encryption algorithms */

"06 08 2A 86 48 86 F7 0D 03"			= "خوارزمية تشفير RSADSI";
"06 08 2A 86 48 86 F7 0D 03 02"			= "RC2-CBC
";
"06 08 2A 86 48 86 F7 0D 03 03"			= "RC2-ECB";
"06 08 2A 86 48 86 F7 0D 03 04"			= "RC4";
"06 08 2A 86 48 86 F7 0D 03 05"			= "RC4 مع MAC";
"06 08 2A 86 48 86 F7 0D 03 06"			= "DESX-CBC
";
"06 08 2A 86 48 86 F7 0D 03 07"			= "DES-EDE3-CBC
";
"06 08 2A 86 48 86 F7 0D 03 08"			= "RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 09"			= "RC5-CBC Pad
";
"06 08 2A 86 48 86 F7 0D 03 0A"			= "DES-CDMF";

/* Identrus */

"06 09 2A 86 48 86 FA 65 01 06 01"		= "معرف سياسة Identrus المجهول";
"06 08 2A 86 48 86 FA 65 04 01"			= "Identrus OCSP";

/* Ascom Systech */

"06 0A 2B 06 01 04 01 81 3C 07 01 01"		= "Ascom";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 01"	= "IDEA-ECB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 02"	= "IDEA-CBC";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 03"	= "IDEA-CFB
";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 04"	= "IDEA-OFB";

/* MIT */

"06 09 2A 86 48 86 F7 12 01 02 02"			= "MIT Kerberos V5";
"06 0A 2A 86 48 86 F7 12 01 02 02 03"		= "بين مستخدمين MIT و Kerberos";

/* Microsoft */

"06 09 2A 86 48 82 F7 12 01 02 02"			= "Microsoft Kerberos";

"06 08 2A 86 48 86 F7 14 01 03"				= "صنف كائن خادم Microsoft Exchange";
"06 09 2A 86 48 86 F7 14 01 03 00"			= "Site-Addressing";
"06 09 2A 86 48 86 F7 14 01 03 0D"			= "مخطط الصنف";
"06 09 2A 86 48 86 F7 14 01 03 0E"			= "مخطط السمة";
"06 09 2A 86 48 86 F7 14 01 03 11"			= "وكيل-صندوق البريد";
"06 09 2A 86 48 86 F7 14 01 03 16"			= "صندوق البريد";
"06 09 2A 86 48 86 F7 14 01 03 17"			= "حاوية";
"06 09 2A 86 48 86 F7 14 01 03 2E"			= "مستلم البريد";
"06 09 2A 86 48 86 F7 14 01 02 81 71"		= "تقنية التسليم";

"06 07 2A 86 48 86 F7 14 04"				= "تنسيقات ملف Microsoft";
"06 08 2A 86 48 86 F7 14 04 02"				= "Microsoft Word";
"06 08 2A 86 48 86 F7 14 04 03"				= "Microsoft Excel";
"06 08 2A 86 48 86 F7 14 04 04"				= "Microsoft Project";
"06 08 2A 86 48 86 F7 14 04 05"				= "Microsoft PowerPoint";
"06 08 2A 86 48 86 F7 14 04 06"				= "Microsoft Works
";

"06 08 2B 06 01 04 01 82 37 02"				= "Authenticode";
"06 0A 2B 06 01 04 01 82 37 02 01 04"		= "سياق بيانات SPC الغير مباشرة";
"06 0A 2B 06 01 04 01 82 37 02 01 0A"		= "معلومات وكالة SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0B"		= "نوع بيان SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0C"		= "معلومات SPC Opus";
"06 0A 2B 06 01 04 01 82 37 02 01 0E"		= "ملحقات شهادة SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0F"		= "بيانات صورة SPC PE";
"06 0A 2B 06 01 04 01 82 37 02 01 14"		= "رابط SPC (نوع ١ )";
"06 0A 2B 06 01 04 01 82 37 02 01 15"		= "توقيع رمز فردي";
"06 0A 2B 06 01 04 01 82 37 02 01 16"		= "توقيع رمز تجاري";
"06 0A 2B 06 01 04 01 82 37 02 01 19"		= "رابط SPC (نوع ٢)";
"06 0A 2B 06 01 04 01 82 37 02 01 1A"		= "الحد الأدنى من معيار SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 1B"		= "المعيار المالي SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 1C"		= "رابط SPC (نوع ٣ )";

"06 0A 2B 06 01 04 01 82 37 02 02 0A"		= "موّفر دعم الأمن NTLM";
"06 0A 2B 06 01 04 01 82 37 03 02 01"		= "تثبيت توقيع الطابع الزمني";

"06 09 2B 06 01 04 01 82 37 0A 01"			= "قائمة ثقة الشهادة";
"06 0A 2B 06 01 04 01 82 37 0A 01 01"		= "ملحق Sorted CTL";
"06 09 2B 06 01 04 01 82 37 0A 02"			= "موقع التحديث التالي";

"06 09 2B 06 01 04 01 82 37 0A 03"			= "استعمال المفتاح المسند";
"06 0A 2B 06 01 04 01 82 37 0A 03 01"		= "توقيع قائمة ثقة الشهادة";
"06 0A 2B 06 01 04 01 82 37 0A 03 02"		= "توقيع الطابع الزمني";
"06 0A 2B 06 01 04 01 82 37 0A 03 03"		= "تشفير عن طريق بوابة الخادم";
"06 0B 2B 06 01 04 01 82 37 0A 03 03 01"	= "تشفير Serialized";
"06 0A 2B 06 01 04 01 82 37 0A 03 04"		= "نظم الملف المشفر";
"06 0B 2B 06 01 04 01 82 37 0A 03 04 01"	= "استرداد نظم الملف المشفر";
"06 0A 2B 06 01 04 01 82 37 0A 03 05"		= "Windows Hardware Compatible";
"06 0A 2B 06 01 04 01 82 37 0A 03 06"		= "توقيع NT5";
"06 0A 2B 06 01 04 01 82 37 0A 03 07"		= "توقيع Windows Hardware OEM";
"06 0A 2B 06 01 04 01 82 37 0A 03 08"		= "توقيع NT المضمن";
"06 0A 2B 06 01 04 01 82 37 0A 03 09"		= "توقيع قائمة الثقة الجذرية";
"06 0A 2B 06 01 04 01 82 37 0A 03 0A"		= "تنازل مؤهل";
"06 0A 2B 06 01 04 01 82 37 0A 03 0B"		= "استرداد المفتاح";
"06 0A 2B 06 01 04 01 82 37 0A 03 0C"		= "توقيع المستند";

"06 09 2B 06 01 04 01 82 37 0A 04"			= "مُعرّفون سمة الكائن";
"06 0A 2B 06 01 04 01 82 37 0A 04 01"		= "سمة الثقة نعم/لا";
"06 0A 2B 06 01 04 01 82 37 0A 05 01"		= "Microsoft Music DRM";
"06 0A 2B 06 01 04 01 82 37 0A 05 02"		= "فردية Microsoft DRM";
"06 0A 2B 06 01 04 01 82 37 0A 06 01"		= "تراخيص Microsoft";
"06 0A 2B 06 01 04 01 82 37 0A 06 02"		= "خادم ترخيص Microsoft";

"06 08 2B 06 01 04 01 82 37 0D"				= "مُعرّفون كائن Microsoft PKCS-10";
"06 09 2B 06 01 04 01 82 37 0D 01"			= "تجديد الشهادة";
"06 0A 2B 06 01 04 01 82 37 0D 02 01"		= "تسجيل اقتران الاسم/القيمة";
"06 0A 2B 06 01 04 01 82 37 0D 02 02"		= "تسجيل CSP";
"06 0A 2B 06 01 04 01 82 37 0D 02 03"		= "إصدار OS";
"06 08 2B 06 01 04 01 82 37 0F"				= "Microsoft Java";
"06 08 2B 06 01 04 01 82 37 10"				= "Microsoft Outlook/Exchange
";
"06 09 2B 06 01 04 01 82 37 10 04"			= "Microsoft Outlook Express";
"06 08 2B 06 01 04 01 82 37 11"				= "سمات Microsoft PKCS-12";
"06 09 2B 06 01 04 01 82 37 11 01"			= "Local Machine Keyset";

"06 08 2B 06 01 04 01 82 37 14"				= "البُنية الأساسية لتسجيل Microsoft";
"06 09 2B 06 01 04 01 82 37 14 01"			= "استعمال التسجيل التلقائي CTL";
"06 09 2B 06 01 04 01 82 37 14 02"			= "نوع شهادة التسجيل";
"06 0A 2B 06 01 04 01 82 37 14 02 01"		= "وكيل التسجيل";
"06 0A 2B 06 01 04 01 82 37 14 02 02"		= "بطاقة الدخول";
"06 0A 2B 06 01 04 01 82 37 14 02 03"		= "الاسم الرئيسي NT";

"06 08 2B 06 01 04 01 82 37 15"				= "البُنية الأساسية لخادم شهادة Microsoft";
"06 09 2B 06 01 04 01 82 37 15 01"			= "إصدار تجديد Microsoft CA";
"06 08 2B 06 01 04 01 82 37 58"				= "CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 01"			= "إصدار CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 02"			= "سمة CAPICOM";
"06 0A 2B 06 01 04 01 82 37 58 02 01"		= "اسم المستند";
"06 0A 2B 06 01 04 01 82 37 58 02 02"		= "وصف المستند";
"06 09 2B 06 01 04 01 82 37 58 03"			= "بيانات مشفرة";
"06 0A 2B 06 01 04 01 82 37 58 03 01"		= "محتوى مشفر";

/* UNINETT */

"06 0A 2B 06 01 04 01 92 7C 0A 01 01"		= "معرف سياسة UNINETT";

/* ICE-TEL */

"06 08 2B 06 01 04 01 95 18 0A"				= "معرف سياسة ICE-TEL";
"06 0A 2B 06 01 04 01 95 62 01 01 01"		= "معرف سياسة CE-TEL CA";

/* cryptlib */

"06 0A 2B 06 01 04 01 97 55 01 01 01"		= "Blowfish-ECB
";
"06 0A 2B 06 01 04 01 97 55 01 01 02"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 01 03"		= "Blowfish-CFB
";
"06 0A 2B 06 01 04 01 97 55 01 01 04"		= "Blowfish-OFB
";
"06 0A 2B 06 01 04 01 97 55 01 02 01"		= "ElGamal";
"06 0B 2B 06 01 04 01 97 55 01 02 01 01"	= "ElGamal مع SHA-1";
"06 0B 2B 06 01 04 01 97 55 01 02 01 02"	= "ElGamal مع RIPEMD-160";
"06 09 2B 06 01 04 01 97 55 03 01"			= "سمات cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 01"		= "تأكد وجود cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 02"		= "استجابة OCSP RTCS";
"06 0A 2B 06 01 04 01 97 55 03 01 03"		= "استجابة OCSP RTCS الموسعة";
"06 0A 2B 06 01 04 01 97 55 03 01 04"		= "تمديد إصدارة CRL";
"06 0A 2B 06 01 04 01 97 55 03 01 05"		= "ميزات المفتاح";
"06 0A 2B 06 01 04 01 97 55 03 01 06"		= "إقلاع PKI";
"06 09 2B 06 01 04 01 97 55 04 01"			= "محتوى cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 01"		= "بيانات تشكيل cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 02"		= "فهرس مستخدم cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 03"		= "معلومات مستخدم cryptlib";
"06 0B 2B 06 01 04 01 97 55 2A D7 24 01"	= "MPEG-1";
"06 0C 2B 06 01 04 01 97 55 58 59 5A 5A 59"	= "معرف سياسة XYZZY";

/* Timeproof (www.timeproof.de) */

"06 07 2B 06 01 04 01 AA 60"		= "Timeproof";
"06 08 2B 06 01 04 01 AA 60 01"		= "نظام التوقيع الزمني";
"06 09 2B 06 01 04 01 AA 60 01 01"	= "نظام تالوقيع الزمني ٨٠";
"06 09 2B 06 01 04 01 AA 60 01 02"	= "نظام التوقيع الزمني ٣٨٠";
"06 09 2B 06 01 04 01 AA 60 01 03"	= "نظام التوقيع الزمني ٤٠٠";

/* MEDePass */

"06 09 2B 06 01 04 01 AD 0A 00 03"  = "ممارسات ثانوية";
"06 09 2B 06 01 04 01 AD 0A 00 04"  = "مُعرّفون الطبيب";

/* Kerberos */

"06 05 2B 06 01 05 02"              = "Kerberos v5
";
"06 06 2B 06 01 05 02 03"           = "Kerberos PKINIT";
"06 07 2B 06 01 05 02 03 01"        = "بيانات مصادقة Kerberos";
"06 07 2B 06 01 05 02 03 02"        = "بيانات مفتاح Kerberos Diffie-Hellman";
"06 07 2B 06 01 05 02 03 03"        = "بيانات مفتاح رد Kerberos";
"06 07 2B 06 01 05 02 03 04"        = "مصادقة العميل Kerberos";
"06 07 2B 06 01 05 02 03 05"        = "Kerberos Key Distribution Center (KDC)";

/* IANA */

"06 06 2B 06 01 05 05 01"			= "Simple Public Key Mechanism (SPKM)";
"06 06 2B 06 01 05 05 02"			= "SPNEGO";

/* PKIX */

"06 06 2B 06 01 05 05 07"			= "البُنية الأساسية للمفتاح العام";

"06 07 2B 06 01 05 05 07 01"		= "ملحقات الشهادة الخاصة PKIX";
"06 08 2B 06 01 05 05 07 01 01"		= "الوصول لمعلومات سلطة الشهادة";
"06 08 2B 06 01 05 05 07 01 02"		= "معلومات بيومترية";
"06 08 2B 06 01 05 05 07 01 03"		= "بيانات الشهادة المؤهلة";
"06 08 2B 06 01 05 05 07 01 04"		= "شهادة تدقيق شهادة السمة";
"06 08 2B 06 01 05 05 07 01 05"		= "استهداف شهادة السمة";
"06 08 2B 06 01 05 05 07 01 06"		= "رقابة سلطة شهادة السمة";
"06 08 2B 06 01 05 05 07 01 07"		= "حظر عنوان SBGP IP";
"06 08 2B 06 01 05 05 07 01 08"		= "معرف النظام الذاتي SBGP";
"06 08 2B 06 01 05 05 07 01 09"		= "معرف راوتر SBGP";
"06 08 2B 06 01 05 05 07 01 0A"		= "توسيط شهادة السمة";
"06 08 2B 06 01 05 05 07 01 0B"		= "الوصول لمعلومات الموضوع";
"06 08 2B 06 01 05 05 07 01 0C"		= "Logotype";

"06 07 2B 06 01 05 05 07 02"		= "أنواع مؤهل السياسة";
"06 08 2B 06 01 05 05 07 02 01"		= "بيان ممارسة الشهادة";
"06 08 2B 06 01 05 05 07 02 02"		= "ملاحظة المستخدم";
"06 08 2B 06 01 05 05 07 02 03"		= "ملاحظة نصية";

"06 07 2B 06 01 05 05 07 03"		= "هدف المفتاح";
"06 08 2B 06 01 05 05 07 03 01"		= "مصادقة الخادم";
"06 08 2B 06 01 05 05 07 03 02"		= "مصادقة العميل";
"06 08 2B 06 01 05 05 07 03 03"		= "توقيع الرمز";
"06 08 2B 06 01 05 05 07 03 04"		= "حماية البريد";
"06 08 2B 06 01 05 05 07 03 05"		= "نهاية نظام IPSEC";
"06 08 2B 06 01 05 05 07 03 06"		= "نفق IPSEC";
"06 08 2B 06 01 05 05 07 03 07"		= "مستخدم IPSEC";
"06 08 2B 06 01 05 05 07 03 08"		= "طابع زمني";
"06 08 2B 06 01 05 05 07 03 09"		= "توقيع OCSP";
"06 08 2B 06 01 05 05 07 03 0A"		= "DVCS";
"06 08 2B 06 01 05 05 07 03 0B"		= "مصادقة خادم SBGP AA";

"06 07 2B 06 01 05 05 07 04"		= "أنواع معلومات CMP";
"06 08 2B 06 01 05 05 07 04 01"		= "شهادة تشفير بروتوكول CA";
"06 08 2B 06 01 05 05 07 04 02"		= "أنواع توقيع المفتاح المزدوج";
"06 08 2B 06 01 05 05 07 04 03"		= "أنواع تشفير المفتاح المزدوج";
"06 08 2B 06 01 05 05 07 04 04"		= "خوارزمية متماثلة مفضلة";
"06 08 2B 06 01 05 05 07 04 05"		= "معلومات تحديث مفتاح CA";
"06 08 2B 06 01 05 05 07 04 06"		= "CRL الحالي";
"06 08 2B 06 01 05 05 07 04 07"		= "OIDs غير مدعوم";
"06 08 2B 06 01 05 05 07 04 08"		= "طلب الاشتراك";
"06 08 2B 06 01 05 05 07 04 09"		= "استجابة الاشتراك";
"06 08 2B 06 01 05 05 07 04 0A"		= "طلب مُعامل اقتران المفتاح";
"06 08 2B 06 01 05 05 07 04 0B"		= "استجابة مُعامل اقتران المفتاح";
/* %%% need to expand these labels, but can't find them documented anywhere online! */
"06 08 2B 06 01 05 05 07 04 0C"		= "revPassphrase";
"06 08 2B 06 01 05 05 07 04 0D"		= "implicitConfirm";
"06 08 2B 06 01 05 05 07 04 0E"		= "confirmWaitTime";
"06 08 2B 06 01 05 05 07 04 0F"		= "origPKIMessage";
"06 08 2B 06 01 05 05 07 04 10"		= "suppLangTags";

"06 07 2B 06 01 05 05 07 05"		= "تسجيل CRMF";
"06 08 2B 06 01 05 05 07 05 01"		= "تحكم التسجيل";
"06 09 2B 06 01 05 05 07 05 01 01"	= "رمز التسجيل";
"06 09 2B 06 01 05 05 07 05 01 02"	= "الموّثق";
"06 09 2B 06 01 05 05 07 05 01 03"	= "معلومات نشر PKI";
"06 09 2B 06 01 05 05 07 05 01 04"	= "خيارات أرشيف PKI";
"06 09 2B 06 01 05 05 07 05 01 05"	= "هوية الشهادة القديمة";
"06 09 2B 06 01 05 05 07 05 01 06"	= "مفتاح تشفير البروتوكول";
"06 09 2B 06 01 05 05 07 05 01 07"	= "نموذج شهادة البديل";
"06 09 2B 06 01 05 05 07 05 01 08"	= "نموذج WAP WTLS";

"06 08 2B 06 01 05 05 07 05 02"		= "معلومات تسجيل CRMF";
"06 09 2B 06 01 05 05 07 05 02 01"	= "UTF-8 أزواج";
"06 09 2B 06 01 05 05 07 05 02 02"	= "طلب الشهادة";

"06 07 2B 06 01 05 05 07 06"		= "خوارزميات";
"06 08 2B 06 01 05 05 07 06 01"		= "DES-40
";
"06 08 2B 06 01 05 05 07 06 02"		= "لا يوجد توقيع";
"06 08 2B 06 01 05 05 07 06 03"		= "dh-sig-hmac-sha1";
"06 08 2B 06 01 05 05 07 06 04"		= "dh-pop";

"06 07 2B 06 01 05 05 07 07"		= "رقابات CMC";

"06 07 2B 06 01 05 05 07 08"		= "أسماء أخرى";
"06 08 2B 06 01 05 05 07 08 01"		= "بيانات شخصية";
"06 08 2B 06 01 05 05 07 08 02"		= "مجموعة المستخدم";

"06 07 2B 06 01 05 05 07 09"		= "بيانات شخصية";
"06 08 2B 06 01 05 05 07 09 01"		= "تاريخ الميلاد";
"06 08 2B 06 01 05 05 07 09 02"		= "مكان الولادة";
"06 08 2B 06 01 05 05 07 09 03"		= "اسم مستعار";
"06 08 2B 06 01 05 05 07 09 04"		= "الجنس";
"06 08 2B 06 01 05 05 07 09 05"		= "بلد الجنسية";
"06 08 2B 06 01 05 05 07 09 06"		= "بلد الإقامة";

"06 07 2B 06 01 05 05 07 0A"		= "شهادة السمة";
"06 08 2B 06 01 05 05 07 0A 01"		= "معلومات المصادقة";
"06 08 2B 06 01 05 05 07 0A 02"		= "وصول للهوية";
"06 08 2B 06 01 05 05 07 0A 03"		= "هوية المسؤول";
"06 08 2B 06 01 05 05 07 0A 04"		= "مجموعة";
"06 08 2B 06 01 05 05 07 0A 05"		= "دور";
"06 08 2B 06 01 05 05 07 0A 06"		= "WLAN SSID";

/* OCSP */

"06 08 2B 06 01 05 05 07 30 01"		= "بروتوكول حالة الشهادة بالاتصال";
"06 09 2B 06 01 05 05 07 30 01 01"	= "استجابة OCSP الأساسية";
"06 09 2B 06 01 05 05 07 30 01 02"	= "ملحق OCSP Nonce";
"06 09 2B 06 01 05 05 07 30 01 03"	= "مرجع OCSP CRL";
"06 09 2B 06 01 05 05 07 30 01 04"	= "استجابة OCSP";
"06 09 2B 06 01 05 05 07 30 01 05"	= "تأكد من عدم إلغاء OCSP";
"06 09 2B 06 01 05 05 07 30 01 06"	= "قطع أرشيف OCSP";
"06 09 2B 06 01 05 05 07 30 01 07"	= "محدد موقع خدمة OCSP";

"06 08 2B 06 01 05 05 07 30 02"		= "مصادر CA";
"06 08 2B 06 01 05 05 07 30 03"		= "طابع زمني";

/* ISAKMP */

"06 08 2B 06 01 05 05 08 01 01"		= "HMAC MD5";
"06 08 2B 06 01 05 05 08 01 02"		= "HMAC SHA-1";
"06 08 2B 06 01 05 05 08 01 03"		= "HMAC Tiger";
"06 08 2B 06 01 05 05 08 02 02"		= "وسيطة IKE";

/* DEC (via ECMA) */

"06 07 2B 0C 02 87 73 07 01"		= "خوارزمية تشفير DEC";
"06 08 2B 0C 02 87 73 07 01 02"		= "DEC DEA";
"06 07 2B 0C 02 87 73 07 02"		= "خوارزمية تجزئة DEC";
"06 07 2B 0C 02 87 73 07 02 01"		= "DEC MD2";
"06 07 2B 0C 02 87 73 07 02 02"		= "DEC MD4
";
"06 07 2B 0C 02 87 73 07 03"		= "خوارزمية توقيع DEC";
"06 07 2B 0C 02 87 73 07 03 01"		= "DEC MD2 مع RSA";
"06 07 2B 0C 02 87 73 07 03 02"		= "DEC MD4 مع RSA";
"06 07 2B 0C 02 87 73 07 03 03"		= "DEC DEA-MAC";

/* NIST Open Systems Environment (OSE) Implementor's Workshop (OIW) */

"06 05 2B 0E 02 1A 05"				= "SHA
";
"06 06 2B 0E 03 02 01 01"			= "RSA";
"06 05 2B 0E 03 02 02"				= "MD4 مع RSA
";
"06 05 2B 0E 03 02 03"				= "MD5 مع RSA
";
"06 05 2B 0E 03 02 04"				= "تشفير MD4 مع RSA";
"06 06 2B 0E 03 02 02 01"			= "SqMod-N";
"06 06 2B 0E 03 02 03 01"			= "SqMod-N with RSA";
"06 05 2B 0E 03 02 06"				= "DES-ECB
";
"06 05 2B 0E 03 02 07"				= "DES-CBC
";
"06 05 2B 0E 03 02 08"				= "DES-OFB
";
"06 05 2B 0E 03 02 09"				= "DES-CFB
";
"06 05 2B 0E 03 02 0A"				= "DES-MAC";
"06 05 2B 0E 03 02 0B"				= "توقيع RSA";
"06 05 2B 0E 03 02 0C"				= "DSA";
"06 05 2B 0E 03 02 0D"				= "DSA مع SHA";
"06 05 2B 0E 03 02 0E"				= "توقيع MDC2 مع RSA";
"06 05 2B 0E 03 02 0F"				= "توقيع SHA مع RSA";
"06 05 2B 0E 03 02 10"				= "Diffie-Hellman مع Modulus الشائع";
"06 05 2B 0E 03 02 11"				= "DES-EDE";
"06 05 2B 0E 03 02 12"				= "SHA
";
"06 05 2B 0E 03 02 13"				= "MDC-2";
"06 05 2B 0E 03 02 14"				= "DSA الشائع";
"06 05 2B 0E 03 02 15"				= "DSA الشائع مع SHA";
"06 05 2B 0E 03 02 16"				= "نقل مفتاح RSA";
"06 05 2B 0E 03 02 17"				= "Keyed-hash-seal";
"06 05 2B 0E 03 02 18"				= "توقيع MD2 مع RSA";
"06 05 2B 0E 03 02 19"				= "توقيع MD5 مع RSA";
"06 05 2B 0E 03 02 1A"				= "SHA-1
";
"06 05 2B 0E 03 02 1B"				= "DSA مع SHA-1";
"06 05 2B 0E 03 02 1C"				= "DSA مع SHA-1 الشائع";
"06 05 2B 0E 03 02 1D"				= "تشفير SHA-1 مع RSA";
"06 05 2B 0E 03 03 01"				= "Simple-strong-auth-mechanism";
"06 06 2B 0E 07 02 01 01"			= "ElGamal";
"06 06 2B 0E 07 02 03 01"			= "MD2 مع RSA
";
"06 06 2B 0E 07 02 03 02"			= "MD2 مع ElGamal";

/* Teletrust */

"06 03 2B 24 01"					= "مستند";
"06 04 2B 24 01 01"					= "الإصدار النهائي";
"06 04 2B 24 01 02"					= "مسودة";
"06 03 2B 24 02"					= "SIO";
"06 04 2B 24 02 01"					= "SEDU";

"06 03 2B 24 03"					= "خوارزمية";
"06 04 2B 24 03 01"					= "خوارزمية التشفير";
"06 05 2B 24 03 01 01"				= "DES";
"06 06 2B 24 03 01 01 01"			= "DES-ECB Pad
";
"06 07 2B 24 03 01 01 01 01"		= "DES-ECB ISO Pad
";
"06 07 2B 24 03 01 01 02 01"		= "DES-CBC Pad
";
"06 08 2B 24 03 01 01 02 01 01"		= "DES-CBC ISO Pad
";
"06 05 2B 24 03 01 03"				= "DES3";
"06 07 2B 24 03 01 03 01 01"		= "DES3-ECB Pad
";
"06 08 2B 24 03 01 03 01 01 01"		= "DES3-ECB ISO Pad
";
"06 07 2B 24 03 01 03 02 01"		= "DES3-CBC Pad
";
"06 08 2B 24 03 01 03 02 01 01"		= "DES3-CBC ISO Pad";
"06 05 2B 24 03 01 02"				= "IDEA";
"06 06 2B 24 03 01 02 01"			= "IDEA-ECB";
"06 07 2B 24 03 01 02 01 01"		= "IDEA-ECB Pad
";
"06 08 2B 24 03 01 02 01 01 01"		= "IDEA-ECB ISO Pad
";
"06 06 2B 24 03 01 02 02"			= "IDEA-CBC";
"06 07 2B 24 03 01 02 02 01"		= "IDEA-CBC Pad
";
"06 08 2B 24 03 01 02 02 01 01"		= "IDEA-CBC ISO Pad
";
"06 06 2B 24 03 01 02 03"			= "IDEA-OFB";
"06 06 2B 24 03 01 02 04"			= "IDEA-CFB
";
"06 05 2B 24 03 01 04"				= "تشفير RSA";
"06 05 2B 24 03 01 05"				= "BSI-1";
"06 06 2B 24 03 01 05 01"			= "BSI-1-ECB Pad
";
"06 06 2B 24 03 01 05 02"			= "BSI-1-CBC Pad";
"06 07 2B 24 03 01 05 02 01"		= "BSI-1-CBC PEM Pad
";

"06 04 2B 24 03 02"					= "خوارزمية التجزئة";
"06 05 2B 24 03 02 01"				= "RIPEMD-160
";
"06 05 2B 24 03 02 02"				= "RIPEMD-128
";
"06 05 2B 24 03 02 03"				= "RIPEMD-256";
"06 05 2B 24 03 02 04"				= "MDC2 طول منفرد";
"06 05 2B 24 03 02 05"				= "MDC2 طول مزدوج";
"06 04 2B 24 03 03"					= "خوارزمية التوقيع";
"06 05 2B 24 03 03 01"				= "توقيع RSA";

"06 06 2B 24 03 03 01 01"			= "توقيع RSA مع SHA-1";
"06 09 2B 24 03 03 01 01 84 00 02"	= "توقيع RSA مع SHA-1 512/L2";
"06 09 2B 24 03 03 01 01 85 00 02"	= "توقيع RSA مع SHA-1 640/L2";
"06 09 2B 24 03 03 01 01 86 00 02"	= "توقيع RSA مع SHA-1 768/L2";
"06 09 2B 24 03 03 01 01 87 00 02"	= "توقيع RSA مع SHA-1 896/L2";
"06 09 2B 24 03 03 01 01 88 00 02"	= "توقيع RSA مع SHA-1 1024/L2";
"06 09 2B 24 03 03 01 01 84 00 03"	= "توقيع RSA مع SHA-1 512/L3";
"06 09 2B 24 03 03 01 01 85 00 03"	= "توقيع RSA مع SHA-1 640/L3";
"06 09 2B 24 03 03 01 01 86 00 03"	= "توقيع RSA مع SHA-1 768/L3";
"06 09 2B 24 03 03 01 01 87 00 03"	= "توقيع RSA مع SHA-1 896/L3";
"06 09 2B 24 03 03 01 01 88 00 03"	= "توقيع RSA مع SHA-1 1024/L3";
"06 09 2B 24 03 03 01 01 84 00 05"	= "توقيع RSA مع SHA-1 512/L5";
"06 09 2B 24 03 03 01 01 85 00 05"	= "توقيع RSA مع SHA-1 640/L5";
"06 09 2B 24 03 03 01 01 86 00 05"	= "توقيع RSA مع SHA-1 768/L5";
"06 09 2B 24 03 03 01 01 87 00 05"	= "توقيع RSA مع SHA-1 896/L5";
"06 09 2B 24 03 03 01 01 88 00 05"	= "توقيع RSA مع SHA-1 1024/L5";
"06 09 2B 24 03 03 01 01 84 00 09"	= "توقيع RSA مع SHA-1 512/L9";
"06 09 2B 24 03 03 01 01 85 00 09"	= "توقيع RSA مع SHA-1 640/L9";
"06 09 2B 24 03 03 01 01 86 00 09"	= "توقيع RSA مع SHA-1 768/L9";
"06 09 2B 24 03 03 01 01 87 00 09"	= "توقيع RSA مع SHA-1 896/L9";
"06 09 2B 24 03 03 01 01 88 00 09"	= "توقيع RSA مع SHA-1 1024/L9";
"06 09 2B 24 03 03 01 01 84 00 11"	= "توقيع RSA مع SHA-1 512/L11";
"06 09 2B 24 03 03 01 01 85 00 11"	= "توقيع RSA مع SHA-1 640/L11";
"06 09 2B 24 03 03 01 01 86 00 11"	= "توقيع RSA مع SHA-1 768/L11";
"06 09 2B 24 03 03 01 01 87 00 11"	= "توقيع RSA مع SHA-1 896/L11";
"06 09 2B 24 03 03 01 01 88 00 11"	= "توقيع RSA مع SHA-1 1024/L11";

"06 06 2B 24 03 03 01 02"			= "توقيع RSA مع RIPEMD-160";
"06 09 2B 24 03 03 01 02 84 00 02"	= "توقيع RSA مع RIPEMD-160 512/L2";
"06 09 2B 24 03 03 01 02 85 00 02"	= "توقيع RSA مع RIPEMD-160 640/L2";
"06 09 2B 24 03 03 01 02 86 00 02"	= "توقيع RSA مع RIPEMD-160 768/L2";
"06 09 2B 24 03 03 01 02 87 00 02"	= "توقيع RSA مع RIPEMD-160 896/L2";
"06 09 2B 24 03 03 01 02 88 00 02"	= "توقيع RSA مع RIPEMD-160 1024/L2";
"06 09 2B 24 03 03 01 02 84 00 03"	= "توقيع RSA مع RIPEMD-160 512/L3";
"06 09 2B 24 03 03 01 02 85 00 03"	= "توقيع RSA مع RIPEMD-160 640/L3";
"06 09 2B 24 03 03 01 02 86 00 03"	= "توقيع RSA مع RIPEMD-160 768/L3";
"06 09 2B 24 03 03 01 02 87 00 03"	= "توقيع RSA مع RIPEMD-160 896/L3";
"06 09 2B 24 03 03 01 02 88 00 03"	= "توقيع RSA مع RIPEMD-160 1024/L3";
"06 09 2B 24 03 03 01 02 84 00 05"	= "توقيع RSA مع RIPEMD-160 512/L5";
"06 09 2B 24 03 03 01 02 85 00 05"	= "توقيع RSA مع RIPEMD-160 640/L5";
"06 09 2B 24 03 03 01 02 86 00 05"	= "توقيع RSA مع RIPEMD-160 768/L5";
"06 09 2B 24 03 03 01 02 87 00 05"	= "توقيع RSA مع RIPEMD-160 896/L5";
"06 09 2B 24 03 03 01 02 88 00 05"	= "توقيع RSA مع RIPEMD-160 1024/L5";
"06 09 2B 24 03 03 01 02 84 00 09"	= "توقيع RSA مع RIPEMD-160 512/L9";
"06 09 2B 24 03 03 01 02 85 00 09"	= "توقيع RSA مع RIPEMD-160 640/L9";
"06 09 2B 24 03 03 01 02 86 00 09"	= "توقيع RSA مع RIPEMD-160 768/L9";
"06 09 2B 24 03 03 01 02 87 00 09"	= "توقيع RSA مع RIPEMD-160 896/L9";
"06 09 2B 24 03 03 01 02 88 00 09"	= "توقيع RSA مع RIPEMD-160 1024/L9";
"06 09 2B 24 03 03 01 02 84 00 11"	= "توقيع RSA مع RIPEMD-160 512/L11";
"06 09 2B 24 03 03 01 02 85 00 11"	= "توقيع RSA مع RIPEMD-160 640/L11";
"06 09 2B 24 03 03 01 02 86 00 11"	= "توقيع RSA مع RIPEMD-160 768/L11";
"06 09 2B 24 03 03 01 02 87 00 11"	= "توقيع RSA مع RIPEMD-160 896/L11";
"06 09 2B 24 03 03 01 02 88 00 11"	= "توقيع RSA مع RIPEMD-160 1024/L11";

"06 06 2B 24 03 03 01 03"			= "توقيع RSA مع RIPEMD-128";
"06 06 2B 24 03 03 01 04"			= "توقيع RSA مع RIPEMD-256";

"06 05 2B 24 03 03 02"				= "توقيع ECSIE";
"06 06 2B 24 03 03 02 01"			= "توقيع ECSIE مع SHA-1";
"06 06 2B 24 03 03 02 02"			= "توقيع ECSIE مع RIPEMD-160";
"06 06 2B 24 03 03 02 03"			= "توقيع ECSIE مع MD2";
"06 06 2B 24 03 03 02 04"			= "توقيع ECSIE مع MD5";

"06 04 2B 24 03 04"					= "توقيع Scheme";
"06 05 2B 24 03 04 01"				= "ISO9796-1
";
"06 05 2B 24 03 04 02"				= "ISO9796-2";
"06 05 2B 24 03 04 02 01"			= "ISO9796-2 مع RED";
"06 06 2B 24 03 04 02 02"			= "ISO9796-2 مع RSA";
"06 06 2B 24 03 04 02 03"			= "ISO9796-2 مع RND";

"06 03 2B 24 04"					= "السمة";
"06 03 2B 24 05"					= "سياسة";
"06 03 2B 24 06"					= "API";
"06 04 2B 24 06 01"					= "الصانع المحدد API";
"06 05 2B 24 06 01 01"				= "UTIMACO-API";
"06 04 2B 24 06 02"					= "الوظيفة المحددة API";
"06 03 2B 24 07"					= "إدارة المفتاح";
"06 04 2B 24 07 01"					= "إتفاقية المفتاح";
"06 05 2B 24 07 01 01"				= "BSI PKE";
"06 04 2B 24 07 02"					= "تحويل المفتاح";
"06 05 2B 24 07 02 01"				= "تشفير ISO9796-2 مع RSA";

"06 05 2B 24 08 01 01"				= "معرف سياسة Teletrust SigiSigConform";
"06 05 2B 24 08 02 01"				= "خدمة الدليل";

"06 05 2B 24 08 03 01"				= "تاريخ توليد الشهادة";
"06 05 2B 24 08 03 02"				= "الوكالة";
"06 05 2B 24 08 03 03"				= "قبول";
"06 05 2B 24 08 03 04"				= "الحد النقدي";
"06 05 2B 24 08 03 05"				= "إعلان الأغلبية";
"06 05 2B 24 08 03 06"				= "الرقم المتسلسل لبطاقة الدائرة المتكاملة";
"06 05 2B 24 08 03 07"				= "مرجع المفتاح العام";
"06 05 2B 24 08 03 08"				= "تقييد";
"06 05 2B 24 08 03 09"				= "الاسترجاع إذا تم السماح";
"06 05 2B 24 08 03 0A"				= "شهادة مطلوبة";
"06 05 2B 24 08 03 0B"				= "سلطات التسمية";
"06 05 2B 24 08 03 0C"				= "الشهادة في الدليل منذ";
"06 05 2B 24 08 03 0D"				= "تجزئة الشهادة";

"06 05 2B 24 08 04 01"				= "بيانات شخصية";
"06 05 2B 24 08 04 08"				= "تقييد";
"06 07 2B 24 08 05 01 01 01"		= "RSA مع SHA-1";
"06 07 2B 24 08 05 01 01 02"		= "RSA مع RIPEMD-160";
"06 07 2B 24 08 05 01 01 03"		= "RSA مع SHA-1";
"06 07 2B 24 08 05 01 01 04"		= "RSA مع RIPEMD-160";
"06 07 2B 24 08 05 01 02 01"		= "DSA الموسعة";
"06 07 2B 24 08 05 01 02 02"		= "DSA مع RIPEMD-160";

"06 05 2B 24 08 06 01"				= "شهادة";
"06 05 2B 24 08 06 02"				= "مرجع الشهادة";
"06 05 2B 24 08 06 03"				= "شهادة السمة";
"06 05 2B 24 08 06 04"				= "مرجع السمة";
"06 05 2B 24 08 06 05"				= "اسم الملف";
"06 05 2B 24 08 06 06"				= "زمن التخزين";
"06 05 2B 24 08 06 07"				= "حجم الملف";
"06 05 2B 24 08 06 08"				= "الموقع
";
"06 05 2B 24 08 06 09"				= "رقم التوقيع";
"06 05 2B 24 08 06 0A"				= "Autogenerated";

"06 05 2B 24 08 07 01"				= "أنواع عرض Teletrust";
"06 06 2B 24 08 07 01 01"			= "Adobe Illustrator";
"06 06 2B 24 08 07 01 02"			= "AmiPro";
"06 06 2B 24 08 07 01 03"			= "AutoCAD";
"06 06 2B 24 08 07 01 04"			= "ثنائي";
"06 06 2B 24 08 07 01 05"			= "BMP";
"06 06 2B 24 08 07 01 06"			= "CGM";
"06 06 2B 24 08 07 01 07"			= "CorelCRT";
"06 06 2B 24 08 07 01 08"			= "CorelDRW";
"06 06 2B 24 08 07 01 09"			= "CorelEXC";
"06 06 2B 24 08 07 01 0A"			= "CorelPHT";
"06 06 2B 24 08 07 01 0B"			= "سحب";
"06 06 2B 24 08 07 01 0C"			= "DVI";
"06 06 2B 24 08 07 01 0D"			= "EPS";
"06 06 2B 24 08 07 01 0E"			= "Excel";
"06 06 2B 24 08 07 01 0F"			= "GEM";
"06 06 2B 24 08 07 01 10"			= "GIF";
"06 06 2B 24 08 07 01 11"			= "HPGL";
"06 06 2B 24 08 07 01 12"			= "JPEG";
"06 06 2B 24 08 07 01 13"			= "Kodak";
"06 06 2B 24 08 07 01 14"			= "LaTeX";
"06 06 2B 24 08 07 01 15"			= "Lotus";
"06 06 2B 24 08 07 01 16"			= "LotusPIC";
"06 06 2B 24 08 07 01 17"			= "MacPICT";
"06 06 2B 24 08 07 01 18"			= "MacWord";
"06 06 2B 24 08 07 01 19"			= "MSWfD";
"06 06 2B 24 08 07 01 1A"			= "MSWord";
"06 06 2B 24 08 07 01 1B"			= "MSWord2";
"06 06 2B 24 08 07 01 1C"			= "MSWord6";
"06 06 2B 24 08 07 01 1D"			= "MSWord8";
"06 06 2B 24 08 07 01 1E"			= "PDF";
"06 06 2B 24 08 07 01 1F"			= "PIF";
"06 06 2B 24 08 07 01 20"			= "مستند";
"06 06 2B 24 08 07 01 21"			= "RTF";
"06 06 2B 24 08 07 01 22"			= "SCITEX";
"06 06 2B 24 08 07 01 23"			= "TAR";
"06 06 2B 24 08 07 01 24"			= "Targa";
"06 06 2B 24 08 07 01 25"			= "TeX";
"06 06 2B 24 08 07 01 26"			= "رسالة";
"06 06 2B 24 08 07 01 27"			= "TIFF";
"06 06 2B 24 08 07 01 28"			= "TIFF-FC";
"06 06 2B 24 08 07 01 29"			= "UID";
"06 06 2B 24 08 07 01 2A"			= "UUEncode";
"06 06 2B 24 08 07 01 2B"			= "WMF";
"06 06 2B 24 08 07 01 2C"			= "WordPerfect";
"06 06 2B 24 08 07 01 2D"			= "WPGrph";

/* Thawte */

"06 04 2B 65 01 04"					= "ملحق شهادة Thawte";
"06 05 2B 65 01 04 01"				= "إكسترانت قوية";

/* X.520 */

"06 02 55 04"		= "أنواع سمة X.520";
"06 03 55 04 00"	= "صنف كائن";
"06 03 55 04 01"	= "Aliased اسم الدخول";
"06 03 55 04 02"	= "معلومات معرفية";
"06 03 55 04 03"	= "الاسم الشائع";
"06 03 55 04 04"	= "اسم العائلة";
"06 03 55 04 05"	= "الرقم التسلسلي";
"06 03 55 04 06"	= "اسم البلد";
"06 03 55 04 07"	= "اسم الموقع";
"06 04 55 04 07 01"	= "اسم المنظمة المحلي";
"06 03 55 04 08"	= "اسم الولاية أو المقاطعة";
"06 04 55 04 08 01"	= "اسم ولاية أو مقاطعة المنظمة";
"06 03 55 04 09"	= "عنوان الشارع";
"06 04 55 04 09 01"	= "عنوان شارع المنظمة";
"06 03 55 04 0A"	= "اسم المنظمة";
"06 04 55 04 0A 01"	= "اسم المنظمة";
"06 03 55 04 0B"	= "اسم وحدة المنظمة";
"06 04 55 04 0B 01"	= "اسم وحدة المنظمة";
"06 03 55 04 0C"	= "عنوان";
"06 03 55 04 0D"	= "الوصف";
"06 03 55 04 0E"	= "دليل البحث";
"06 03 55 04 0F"	= "فئة العمل
";
"06 03 55 04 10"	= "العنوان البريدي";
"06 04 55 04 10 01"	= "عنوان بريد المنظمة";
"06 03 55 04 11"	= "الرمز البريدي";
"06 04 55 04 11 01"	= "رمز بريد المنظمة";
"06 03 55 04 12"	= "صندوق البريد";
"06 04 55 04 12 01"	= "صندوق بريد المنظمة";
"06 03 55 04 13"	= "اسم مكتب التسليم الشخصي";
"06 04 55 04 13 01"	= "اسم مكتب التسليم المنظمة";
"06 03 55 04 14"	= "رقم الهاتف";
"06 04 55 04 14 01"	= "رقم هاتف المنظمة";
"06 03 55 04 15"	= "رقم التلكس";
"06 04 55 04 15 01"	= "رقم تلكس المنظمة";
"06 03 55 04 16"	= "معرف محطة Teletex";
"06 04 55 04 16 01"	= "معرف محطة تلكس المنظمة";
"06 03 55 04 17"	= "رقم هاتف الفاكس";
"06 04 55 04 17 01"	= "رقم فاكس المنظمة";
"06 03 55 04 18"	= "عنوان X.121";
"06 03 55 04 19"	= "رقم ISDN الدولي";
"06 04 55 04 19 01"	= "رقم ISDN الدولي لـ للمنظمة";
"06 03 55 04 1A"	= "عنوان مسجل";
"06 03 55 04 1B"	= "مؤشر الوجهة
";
"06 03 55 04 1C"	= "طريقة التسليم المفضلة";
"06 03 55 04 1D"	= "عنوان العرض";
"06 03 55 04 1E"	= "سياق التطبيق المدعوم";
"06 03 55 04 1F"	= "عضو";
"06 03 55 04 20"	= "المالك";
"06 03 55 04 21"	= "شاغل الدور";
"06 03 55 04 22"	= "انظر أيضًا";
"06 03 55 04 23"	= "كلمة سر المستخدم";
"06 03 55 04 24"	= "شهادة المستخدم";
"06 03 55 04 25"	= "شهادة CA";
"06 03 55 04 26"	= "قائمة سلطة الإلغاء";
"06 03 55 04 27"	= "قائمة إلغاء الشهادة";
"06 03 55 04 28"	= "اقتران شهادة Cross";
"06 03 55 04 29"	= "الاسم";
"06 03 55 04 2A"	= "الاسم المعطى";
"06 03 55 04 2B"	= "الحروف الأولى للاسم";
"06 03 55 04 2C"	= "مؤهل التوليد";
"06 03 55 04 2D"	= "معرف فريد";
"06 03 55 04 2E"	= "مؤهل DN";
"06 03 55 04 2F"	= "دليل البحث المسند";
"06 03 55 04 30"	= "معلومات البروتوكول";
"06 03 55 04 31"	= "اسم بارز";
"06 03 55 04 32"	= "عضو فريد";
"06 03 55 04 33"	= "معرف House";
"06 03 55 04 34"	= "خوارزميات مدعومة";
"06 03 55 04 35"	= "قائمة إلغاء Delta";
"06 03 55 04 36"	= "تخليص";
"06 03 55 04 3A"	= "اقتران شهادة Cross";

/* X.500 object classes */

"06 02 55 06"		= "صنف كائن X.520";
"06 03 55 06 00"	= "أعلى";
"06 03 55 06 01"	= "اسم مستعار";
"06 03 55 06 02"	= "البلد";
"06 03 55 06 03"	= "الموقع";
"06 03 55 06 04"	= "المنظمة";
"06 03 55 06 05"	= "وحدة المنظمة";
"06 03 55 06 06"	= "شخص";
"06 03 55 06 07"	= "شخص المنظمة";
"06 03 55 06 08"	= "دور المنظمة";
"06 03 55 06 09"	= "مجموعة من الأسماء";
"06 03 55 06 0A"	= "شخص سكني";
"06 03 55 06 0B"	= "عملية التطبيق";
"06 03 55 06 0C"	= "كيان التطبيق";
"06 03 55 06 0D"	= "DSA";
"06 03 55 06 0E"	= "جهاز";
"06 03 55 06 0F"	= "مستخدم مصدق قوي";
"06 03 55 06 10"	= "سلطة الشهادة";
"06 03 55 06 11"	= "مجموعة من الأسماء الفريدة";
"06 03 55 06 15"	= "مستخدم PKI";
"06 03 55 06 16"	= "PKI CA";

/* X.500 algorithms */

"06 02 55 08"		= "خوارزميات X.500";
"06 03 55 08 01"	= "خوارزميات تشفير X.500";
"06 04 55 08 01 01"	= "RSA";

/* X.509 */

"06 02 55 1D"		= "ملحقات شهادة X.509";
"06 03 55 1D 01"	= "معرف مفتاح السلطة (قديم)";
"06 03 55 1D 02"	= "سمات المفتاح الأساسي (قديم)";
"06 03 55 1D 03"	= "سياسات الشهادة )قديم(";
"06 03 55 1D 04"	= "تقييد استعمال المفتاح (قديم)";
"06 03 55 1D 05"	= "تعيين السياسة (قديم)";
"06 03 55 1D 06"	= "القيد الثانوي";
"06 03 55 1D 07"	= "اسم بديل للموضوع (قديم)";
"06 03 55 1D 08"	= "اسم بديل للمصدر (قديم)";
"06 03 55 1D 09"	= "سمات دليل الموضوع";
"06 03 55 1D 0A"	= "قيود أساسية (قديم 2.5.29.10)";
"06 03 55 1D 0B"	= "قيود الاسم (قديم)";
"06 03 55 1D 0C"	= "قيود السياسة (قديم)";
"06 03 55 1D 0D"	= "قيود أساسية (قديم 2.5.29.13)";
"06 03 55 1D 0E"	= "معرف مفتاح الموضوع";
"06 03 55 1D 0F"	= "استعمال المفتاح";
"06 03 55 1D 10"	= "مدة استعمال المفتاح الخاص";
"06 03 55 1D 11"	= "اسم بديل للموضوع";
"06 03 55 1D 12"	= "اسم بديل للمصدر";
"06 03 55 1D 13"	= "قيود أساسية";
"06 03 55 1D 14"	= "رقم قائمة إلغاء الشهادة";
"06 03 55 1D 15"	= "رمز إصدارة CRL";
"06 03 55 1D 16"	= "تاريخ الصلاحية (قديم)";
"06 03 55 1D 17"	= "رمز أمر التعليق";
"06 03 55 1D 18"	= "تاريخ غير صحيح";
"06 03 55 1D 19"	= "نقاط توزيع CRL (قديم)";
"06 03 55 1D 1A"	= "إصدار نقطة التوزيع (قديم)";
"06 03 55 1D 1B"	= "مؤشر Delta CRL";
"06 03 55 1D 1C"	= "إصدار نقطة التوزيع";
"06 03 55 1D 1D"	= "مصدر الشهادة";
"06 03 55 1D 1E"	= "قيود الاسم";
"06 03 55 1D 1F"	= "نقاط توزيع CRL";
"06 03 55 1D 20"	= "سياسات الشهادة";
"06 04 55 1D 20 00"	= "أي معرف سياسة";
"06 03 55 1D 21"	= "تعينات السياسة";
"06 03 55 1D 22"	= "قيود السياسة";
"06 03 55 1D 23"	= "معرف مفتاح السلطة";
"06 03 55 1D 24"	= "قيود السياسة";
"06 03 55 1D 25"	= "استعمال المفتاح الممدد";
"06 04 55 1D 25 00"	= "استعمال أي مفتاح ممدد";

/* DMS - SDN.700 INFOSEC algorithms */

"06 09 60 86 48 01 65 02 01 01 01"	= "خوارزمية توقيع SDNS";
"06 09 60 86 48 01 65 02 01 01 02"	= "خوارزمية توقيع Fortezza";
"06 09 60 86 48 01 65 02 01 01 03"	= "خوارزمية خصوصية SDNS";
"06 09 60 86 48 01 65 02 01 01 04"	= "خوارزمية خصوصية Fortezza";
"06 09 60 86 48 01 65 02 01 01 05"	= "خوارزمية تكامل SDNS";
"06 09 60 86 48 01 65 02 01 01 06"	= "خوارزمية تكامل Fortezza";
"06 09 60 86 48 01 65 02 01 01 07"	= "خوارزمية حماية رمز SDNS";
"06 09 60 86 48 01 65 02 01 01 08"	= "خوارزمية حماية رمز Fortezza";
"06 09 60 86 48 01 65 02 01 01 09"	= "خوارزمية إدارة مفتاح SDNS";
"06 09 60 86 48 01 65 02 01 01 0A"	= "خوارزمية إدارة مفتاح Fortezza";
"06 09 60 86 48 01 65 02 01 01 0B"	= "خوارزمية توقيع وإدارة مفتاح SDNS";
"06 09 60 86 48 01 65 02 01 01 0C"	= "خوارزمية توقيع وإدارة مفتاح Fortezza";
"06 09 60 86 48 01 65 02 01 01 0D"	= "خوارزمية توقيع Suite A";
"06 09 60 86 48 01 65 02 01 01 0E"	= "خوارزمية خصوصية Suite A";
"06 09 60 86 48 01 65 02 01 01 0F"	= "خوارزمية تكامل Suite A";
"06 09 60 86 48 01 65 02 01 01 10"	= "خوارزمية حماية رمز Suite A";
"06 09 60 86 48 01 65 02 01 01 11"	= "خوارزمية إدارة مفتاح Suite A";
"06 09 60 86 48 01 65 02 01 01 12"	= "خوارزمية توقيع وإدارة مفتاح Suite A";
"06 09 60 86 48 01 65 02 01 01 13"	= "خوارزمية توقيع المحدّثة Fortezza";
"06 09 60 86 48 01 65 02 01 01 14"	= "خوارزميات التوقيع المحدّثة وإدارة مفتاح Fortezza";
"06 09 60 86 48 01 65 02 01 01 15"	= "خوارزمية تكامل المحدّثة Fortezza";
"06 09 60 86 48 01 65 02 01 01 16"	= "خوارزمية مفتاح Exchange";
"06 09 60 86 48 01 65 02 01 01 17"	= "خوارزمية Fortezza Wrap80";
"06 09 60 86 48 01 65 02 01 01 18"	= "خوارزمية تشفير المفتاح (KEA)";

"06 09 60 86 48 01 65 02 01 02 01"	= "تنسيق رسالة RFC 822";
"06 09 60 86 48 01 65 02 01 02 02"	= "محتوى فارغ";
"06 09 60 86 48 01 65 02 01 02 03"	= "نوع محتوى CSP";
"06 09 60 86 48 01 65 02 01 02 2A"	= "نوع محتوى Rev 3";
"06 09 60 86 48 01 65 02 01 02 30"	= "نوع محتوى MSP";
"06 09 60 86 48 01 65 02 01 02 31"	= "بروتوكول وكيل MSP Rekey";
"06 09 60 86 48 01 65 02 01 02 32"	= "MSP MMP
";
"06 09 60 86 48 01 65 02 01 02 42"	= "نوع محتوى Rev 3.1";
"06 09 60 86 48 01 65 02 01 02 48"	= "تحويل رسالة MSP جزء المتن";
"06 09 60 86 48 01 65 02 01 02 49"	= "مُعامِلات رسالة MSP المحولة";
"06 09 60 86 48 01 65 02 01 02 50"	= "تحويل رسالة CSP جزء المتن";
"06 09 60 86 48 01 65 02 01 02 51"	= "مُعامِلات رسالة CSP المحولة";
"06 09 60 86 48 01 65 02 01 02 52"	= "MSP MMP2";

/* SDN.700 INFOSEC policy */

"06 09 60 86 48 01 65 02 01 03 01"		= "سياسة الأمن SDNS";
"06 09 60 86 48 01 65 02 01 03 02"		= "SDNS PRBAC";
"06 09 60 86 48 01 65 02 01 03 03"		= "Mosaic PRBAC";

"06 09 60 86 48 01 65 02 01 03 0A"		= "سياسة الأمن";
"06 0A 60 86 48 01 65 02 01 03 0A 00"	= "NASP";
"06 0A 60 86 48 01 65 02 01 03 0A 01"	= "ELCO";
"06 0A 60 86 48 01 65 02 01 03 0A 02"	= "TK";
"06 0A 60 86 48 01 65 02 01 03 0A 03"	= "DSAP";
"06 0A 60 86 48 01 65 02 01 03 0A 04"	= "SSSS";
"06 0A 60 86 48 01 65 02 01 03 0A 05"	= "DNASP";
"06 0A 60 86 48 01 65 02 01 03 0A 06"	= "BYEMAN";
"06 0A 60 86 48 01 65 02 01 03 0A 07"	= "REL-US";
"06 0A 60 86 48 01 65 02 01 03 0A 08"	= "REL-AUS
";
"06 0A 60 86 48 01 65 02 01 03 0A 09"	= "REL-CAN";
"06 0A 60 86 48 01 65 02 01 03 0A 0A"	= "REL-UK
";
"06 0A 60 86 48 01 65 02 01 03 0A 0B"	= "REL-NZ";
"06 0A 60 86 48 01 65 02 01 03 0A 0C"	= "عام";

"06 09 60 86 48 01 65 02 01 03 0B"			= "genser";
"06 0A 60 86 48 01 65 02 01 03 0B 00"		= "genserNations";
"06 0A 60 86 48 01 65 02 01 03 0B 01"		= "genserComsec";
"06 0A 60 86 48 01 65 02 01 03 0B 02"		= "genserAcquisition";
"06 0A 60 86 48 01 65 02 01 03 0B 03"		= "genserSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0B 03 00"	= "genserTagSetName";

"06 09 60 86 48 01 65 02 01 03 0C"			= "سياسة الأمن الافتراضي";
"06 09 60 86 48 01 65 02 01 03 0D"			= "capcoMarkings";
"06 0A 60 86 48 01 65 02 01 03 0D 00"		= "capcoSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0D 00 01"	= "capcoTagSetName1";
"06 0B 60 86 48 01 65 02 01 03 0D 00 02"	= "capcoTagSetName2";
"06 0B 60 86 48 01 65 02 01 03 0D 00 03"	= "capcoTagSetName3";
"06 0B 60 86 48 01 65 02 01 03 0D 00 04"	= "capcoTagSetName4";

"06 09 60 86 48 01 65 02 01 05 01"	= "شهادة إدارة مفتاح SDNS";
"06 09 60 86 48 01 65 02 01 05 02"	= "شهادة مستخدم توقيع SDNS";
"06 09 60 86 48 01 65 02 01 05 03"	= "شهادة توقيع وإدارة مفتاح SDNS";
"06 09 60 86 48 01 65 02 01 05 04"	= "شهادة إدارة مفتاح Fortezza";
"06 09 60 86 48 01 65 02 01 05 05"	= "شهادة توقيع وإدارة مفتاح Fortezza";
"06 09 60 86 48 01 65 02 01 05 06"	= "شهادة توقيع مستخدم Fortezza";
"06 09 60 86 48 01 65 02 01 05 07"	= "شهادة توقيع Fortezza CA";
"06 09 60 86 48 01 65 02 01 05 08"	= "شهادة توقيع SDNS CA";
"06 09 60 86 48 01 65 02 01 05 0A"	= "متجه إضافي";
"06 09 60 86 48 01 65 02 01 05 0B"	= "سياسة الفاتورة";
"06 09 60 86 48 01 65 02 01 05 0C"	= "عضوية";
"06 09 60 86 48 01 65 02 01 05 0D"	= "المسؤولون";
"06 09 60 86 48 01 65 02 01 05 0E"	= "alid";
"06 09 60 86 48 01 65 02 01 05 14"	= "janUKMs";
"06 09 60 86 48 01 65 02 01 05 15"	= "febUKMs";
"06 09 60 86 48 01 65 02 01 05 16"	= "marUKMs";
"06 09 60 86 48 01 65 02 01 05 17"	= "aprUKMs";
"06 09 60 86 48 01 65 02 01 05 18"	= "mayUKMs";
"06 09 60 86 48 01 65 02 01 05 19"	= "junUKMs";
"06 09 60 86 48 01 65 02 01 05 1A"	= "julUKMs";
"06 09 60 86 48 01 65 02 01 05 1B"	= "augUKMs";
"06 09 60 86 48 01 65 02 01 05 1C"	= "sepUKMs";
"06 09 60 86 48 01 65 02 01 05 1D"	= "octUKMs";
"06 09 60 86 48 01 65 02 01 05 1E"	= "novUKMs";
"06 09 60 86 48 01 65 02 01 05 1F"	= "decUKMs";

"06 09 60 86 48 01 65 02 01 05 28"	= "Meta SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 29"	= "SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 2A"	= "توقيع Meta SDNS مع CKL";
"06 09 60 86 48 01 65 02 01 05 2B"	= "توقيع SDNS مع CKL";
"06 09 60 86 48 01 65 02 01 05 2C"	= "قائمة إلغاء شهادة SDNS";
"06 09 60 86 48 01 65 02 01 05 2D"	= "قائمة إلغاء شهادة Fortezza";
"06 09 60 86 48 01 65 02 01 05 2E"	= "Fortezza CKL";
"06 09 60 86 48 01 65 02 01 05 2F"	= "معالج عنوان Exempted";
"06 09 60 86 48 01 65 02 01 05 30"	= "حارس";
"06 09 60 86 48 01 65 02 01 05 31"	= "الخوارزميات مدعومة";
"06 09 60 86 48 01 65 02 01 05 32"	= "شهادة إدارة مفتاح Suite A";
"06 09 60 86 48 01 65 02 01 05 33"	= "شهادة توقيع وإدارة مفتاح Suite A";
"06 09 60 86 48 01 65 02 01 05 34"	= "شهادة توقيع مستخدم Suite A";
"06 09 60 86 48 01 65 02 01 05 35"	= "معلومات PRBAC";
"06 09 60 86 48 01 65 02 01 05 36"	= "قيود PRBAC CA";
"06 09 60 86 48 01 65 02 01 05 37"	= "توقيع أو امتيازات إدارة المفتاح";
"06 09 60 86 48 01 65 02 01 05 38"	= "امتيازات Comm";
"06 09 60 86 48 01 65 02 01 05 39"	= "سمة بعنوان";
"06 09 60 86 48 01 65 02 01 05 3A"	= "ملف معلومات السياسة";
"06 09 60 86 48 01 65 02 01 05 3B"	= "ملف معلومات سياسة Sec";
"06 09 60 86 48 01 65 02 01 05 3C"	= "قيد تخليص CA";

"06 09 60 86 48 01 65 02 01 07 01"		= "ملحقات CSP";
"06 0A 60 86 48 01 65 02 01 07 01 00"	= "cspCsExtn";
"06 09 60 86 48 01 65 02 01 08 01"		= "فئات أمن ISSI";
"06 09 60 86 48 01 65 02 01 08 02"		= "امتيازات معيار رمز الأمن";

"06 09 60 86 48 01 65 02 01 0A 01"			= "امتيازات التوقيع";
"06 09 60 86 48 01 65 02 01 0A 02"			= "امتيازات إدارة المفتاح";
"06 09 60 86 48 01 65 02 01 0A 03"			= "امتياز مجموعة علامة التسمية";
"06 09 60 86 48 01 65 02 01 0B 01"			= "عرض UK";
"06 09 60 86 48 01 65 02 01 0B 02"			= "وزارة الدفاع الأمريكية الدرجة ٢";
"06 09 60 86 48 01 65 02 01 0B 03"			= "US Medium Pilot";
"06 09 60 86 48 01 65 02 01 0B 04"			= "وزارة الدفاع الأمريكية الدرجة ٤";
"06 09 60 86 48 01 65 02 01 0B 05"			= "وزارة الدفاع الأمريكية الدرجة ٣";
"06 09 60 86 48 01 65 02 01 0B 06"			= "وزارة الدفاع الأمريكية الدرجة ٥";
"06 09 60 86 48 01 65 02 01 0B 09"			= "وزارة الدفاع الأمريكية PKI الدرجة ٣";

"06 09 60 86 48 01 65 02 01 0C 00"			= "سياسة أمن الاختبار";
"06 0A 60 86 48 01 65 02 01 0C 00 01"		= "TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00"	= "TSP1 SecurityCategories";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 00"	= "TSP1 مجموعة علامة صفر";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 01"	= "TSP1 مجموعة علامة واحد";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 02"	= "TSP1 مجموعة علامة اثنين";
"06 0A 60 86 48 01 65 02 01 0C 00 02"		= "TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00"	= "فئات أمن TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 00"	= "TSP2 مجموعة علامة صفر";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 01"	= "TSP2 مجموعة علامة واحد";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 02"	= "TSP2 مجموعة علامة اثنين";

"06 0A 60 86 48 01 65 02 01 0C 00 03"		= "Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00"	= "فئات أمن Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 01"	= "Kafka اسم مجموعة علامة ١";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 02"	= "Kafka اسم مجموعة علامة ٢";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 03"	= "Kafka اسم مجموعة علامة ٣";

"06 0A 60 86 48 01 65 02 01 0C 01 01"		= "TCP1";
"06 09 60 86 48 01 65 02 01 0C 02"			= "مدخلة اختبار CRL";

/* CSOR GAK-FIPS */

"06 07 60 86 48 01 65 03 01"			= "العنوان";
"06 07 60 86 48 01 65 03 02"			= "PKI";
"06 08 60 86 48 01 65 03 02 01"			= "معرف سياسة GAK";
"06 0A 60 86 48 01 65 03 02 01 03 01"	= "معرف سياسة FBCA البدائي";
"06 0A 60 86 48 01 65 03 02 01 03 02"	= "معرف سياسة FBCA الأساسي";
"06 0A 60 86 48 01 65 03 02 01 03 03"	= "معرف سياسة FBCA المتوسط";
"06 0A 60 86 48 01 65 03 02 01 03 04"	= "معرف سياسة FBCA العالي";
"06 08 60 86 48 01 65 03 02 02"			= "GAK";
"06 09 60 86 48 01 65 03 02 02 01"		= "مفتاح KRA";
"06 08 60 86 48 01 65 03 02 03"			= "ملحقات";
"06 09 60 86 48 01 65 03 02 03 01"		= "تقنية استرداد المفتاح";
"06 09 60 86 48 01 65 03 02 03 02"		= "تأهيل استرداد المفتاح";
"06 09 60 86 48 01 65 03 02 03 03"		= "استرداد المفتاح";
"06 08 60 86 48 01 65 03 02 04"			= "مخططات استرداد المفتاح";
"06 08 60 86 48 01 65 03 02 05"			= "ملحقات CSOR GAK";
"06 07 60 86 48 01 65 03 03"			= "ARPA";

/* CSOR (NIST) Algorithms */

"06 07 60 86 48 01 65 03 04"			= "خوارزمية NIST";
"06 08 60 86 48 01 65 03 04 01"			= "AES";
"06 09 60 86 48 01 65 03 04 01 01"		= "AES 128-ECB";
"06 09 60 86 48 01 65 03 04 01 02"		= "AES 128-CBC";
"06 09 60 86 48 01 65 03 04 01 03"		= "AES 128-OFB
";
"06 09 60 86 48 01 65 03 04 01 04"		= "AES 128-CFB";
"06 09 60 86 48 01 65 03 04 01 15"		= "AES 192-ECB
";
"06 09 60 86 48 01 65 03 04 01 16"		= "AES 192-CBC
";
"06 09 60 86 48 01 65 03 04 01 17"		= "AES 192-OFB
";
"06 09 60 86 48 01 65 03 04 01 18"		= "AES 192-CFB
";
"06 09 60 86 48 01 65 03 04 01 29"		= "AES 256-ECB
";
"06 09 60 86 48 01 65 03 04 01 2A"		= "AES 256-CBC
";
"06 09 60 86 48 01 65 03 04 01 2B"		= "AES 256-OFB
";
"06 09 60 86 48 01 65 03 04 01 2C"		= "AES 256-CFB
";

/* NIST secure hash algorithms */

"06 08 60 86 48 01 65 03 04 02"         = "SHA
";
"06 09 60 86 48 01 65 03 04 02 01"      = "SHA-256
";
"06 09 60 86 48 01 65 03 04 02 02"      = "SHA-384
";
"06 09 60 86 48 01 65 03 04 02 03"      = "SHA-512";
"06 09 60 86 48 01 65 03 04 02 04"      = "SHA-224
";

/* Novell */

"06 0A 60 86 48 01 86 F8 37 01 02 08"		= "خوارزمية Novell";
"06 0B 60 86 48 01 86 F8 37 01 02 08 16"	= "DES-CBC IV8
";
"06 0B 60 86 48 01 86 F8 37 01 02 08 17"	= "DES-CBC Pad IV8
";
"06 0B 60 86 48 01 86 F8 37 01 02 08 18"	= "DES-EDE2-CBC IV8
";
"06 0B 60 86 48 01 86 F8 37 01 02 08 19"	= "DES-EDE2-CBC Pad IV8
";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1A"	= "DES-EDE3-CBC IV8
";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1B"	= "DES-EDE3-CBC Pad IV8
";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1C"	= "RC5-CBC Pad
";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1D"	= "تشفير MD2 مع RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1E"	= "تشفير MD5 مع RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1F"	= "تشفير SHA-1 مع RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 20"	= "خلاصة LM";
"06 0B 60 86 48 01 86 F8 37 01 02 08 28"	= "MD2";
"06 0B 60 86 48 01 86 F8 37 01 02 08 32"	= "MD5";
"06 0B 60 86 48 01 86 F8 37 01 02 08 33"	= "IKE HMAC مع SHA1-RSA
";
"06 0B 60 86 48 01 86 F8 37 01 02 08 34"	= "IKE HMAC مع MD5-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 45"	= "RC2-CBC Pad
";
"06 0B 60 86 48 01 86 F8 37 01 02 08 52"	= "SHA-1
";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5C"	= "RC2-CBC BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5F"	= "MD4";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 02"	= "رزمة MD4";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 03"	= "RSA تشفير BSAFE1";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 04"	= "كلمة سر NW";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 05"	= "Novell Obfuscate-1";

"06 09 60 86 48 01 86 F8 37 01 09"			= "PKI";
"06 0A 60 86 48 01 86 F8 37 01 09 04"		= "نوع سمة PKI";
"06 0B 60 86 48 01 86 F8 37 01 09 04 01"	= "سمات الأمن";
"06 0B 60 86 48 01 86 F8 37 01 09 04 02"	= "حد الاعتماد";

/* Netscape */

"06 07 60 86 48 01 86 F8 42"		= "معرف كائن Netscape";
"06 08 60 86 48 01 86 F8 42 01"		= "ملحق شهادة Netscape";
"06 09 60 86 48 01 86 F8 42 01 01"	= "نوع شهادة Netscape";
"06 09 60 86 48 01 86 F8 42 01 02"	= "Netscape URL الأساسي";
"06 09 60 86 48 01 86 F8 42 01 03"	= "إلغاء Netscape URL";
"06 09 60 86 48 01 86 F8 42 01 04"	= "إلغاء Netscape CA URL";
"06 09 60 86 48 01 86 F8 42 01 05"	= "تنزيل Netscape CRL URL";
"06 09 60 86 48 01 86 F8 42 01 06"	= "شهادة تنزيل Netscape CA URL";
"06 09 60 86 48 01 86 F8 42 01 07"	= "شهادة تجديد Netscape URL";
"06 09 60 86 48 01 86 F8 42 01 08"	= "سياسة Netscape CA URL";
"06 09 60 86 48 01 86 F8 42 01 09"	= "شهادة الصفحة الرئيسية Netscape URL";
"06 09 60 86 48 01 86 F8 42 01 0A"	= "شعار كيان شهادة Netscape";
"06 09 60 86 48 01 86 F8 42 01 0B"	= "صورة مستخدم شهادة Netscape";
"06 09 60 86 48 01 86 F8 42 01 0C"	= "اسم خادم Netscape SSL";
"06 09 60 86 48 01 86 F8 42 01 0D"	= "ملاحظة شهادة Netscape";

"06 08 60 86 48 01 86 F8 42 02"		= "نوع بيانات Netscape";
"06 09 60 86 48 01 86 F8 42 02 01"	= "صورة/GIF";
"06 09 60 86 48 01 86 F8 42 02 02"	= "صورة/JPEG";
"06 09 60 86 48 01 86 F8 42 02 03"	= "URL";
"06 09 60 86 48 01 86 F8 42 02 04"	= "text/HTML";

"06 09 60 86 48 01 86 F8 42 02 05"	= "نتيجة شهادة Netscape";
"06 09 60 86 48 01 86 F8 42 02 06"	= "شهادة Netscape URL";

"06 08 60 86 48 01 86 F8 42 03"			= "معرف دليل كائن Netscape";
"06 09 60 86 48 01 86 F8 42 03 01"		= "تعاريف LDAP";
"06 0A 60 86 48 01 86 F8 42 03 01 01"	= "رخصة السيارة
";
"06 0A 60 86 48 01 86 F8 42 03 01 02"	= "رقم الدائرة";
"06 0A 60 86 48 01 86 F8 42 03 01 03"	= "رقم الموظف";
"06 0A 60 86 48 01 86 F8 42 03 01 04"	= "نوع الموظف";
"06 0A 60 86 48 01 86 F8 42 03 02 02"	= "شخص منظمة الإنترانت";

"06 09 60 86 48 01 86 F8 42 04 01"		= "تشفير عن طريق بوابة الخادم";

/* Verisign */

/* Country, zip, date of birth (age), and gender of cert owner (CZAG) in obfuscated form */
"06 0A 60 86 48 01 86 F8 45 01 06 03"	= "Verisign CZAG";

/* Text string used in certs issued to Netscape InBox customers */
"06 0A 60 86 48 01 86 F8 45 01 06 06"	= "Verisign InBox";

"06 0A 60 86 48 01 86 F8 45 01 06 0B"	= "ملحقات Verisign VPN الغير معروفة";
"06 0A 60 86 48 01 86 F8 45 01 06 0D"	= "ملحقات Verisign VPN الغير معروفة";

"06 0B 60 86 48 01 86 F8 45 01 07 01 01"	= "معرف سياسة Verisign";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 01"	= "إشعار Verisign CPS v1";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 02"	= "Verisign CPS v1 NSI";

"06 0A 60 86 48 01 86 F8 45 01 08 01"		= "Verisign SGC CA";

/* SET */

"06 03 67 2A 00"	= "نوع المحتوى";
"06 04 67 2A 00 00"	= "بيانات PAN";
"06 04 67 2A 00 01"	= "رمز PAN";
"06 04 67 2A 00 02"	= "فقط PAN";

"06 03 67 2A 01"	= "ملحق الرسالة";
"06 03 67 2A 02"	= "حقل";
"06 04 67 2A 02 00"	= "الاسم الكامل";
"06 04 67 2A 02 01"	= "الاسم المعطى";
"06 04 67 2A 02 02"	= "اسم العائلة";
"06 04 67 2A 02 03"	= "اسم ميلاد العائلة";
"06 04 67 2A 02 04"	= "اسم المكان";
"06 04 67 2A 02 05"	= "رقم التعريف";
"06 04 67 2A 02 06"	= "شهر";
"06 04 67 2A 02 07"	= "التاريخ";
"06 04 67 2A 02 08"	= "عنوان";
"06 04 67 2A 02 09"	= "الهاتف";
"06 04 67 2A 02 0A"	= "كمية";
"06 04 67 2A 02 0B"	= "رقم الحساب";
"06 04 67 2A 02 0C"	= "عبارة الدخول";

"06 03 67 2A 03"		= "السمة";
"06 04 67 2A 03 00"		= "شهادة";
"06 05 67 2A 03 00 00"	= "بصمة المفتاح الجذري";
"06 05 67 2A 03 00 01"	= "سياسة إضافية";

"06 03 67 2A 04"	= "خوارزمية";
"06 03 67 2A 05"	= "سياسة";
"06 04 67 2A 05 00"	= "جذرية";
"06 03 67 2A 06"	= "Module";
"06 03 67 2A 07"	= "ملحق الشهادة";
"06 04 67 2A 07 00"	= "مفتاح جذري مجزّئ";
"06 04 67 2A 07 01"	= "نوع الشهادة";
"06 04 67 2A 07 02"	= "بيانات التاجر";
"06 04 67 2A 07 03"	= "مطلوب بطاقة الشهادة";
"06 04 67 2A 07 04"	= "النقل";
"06 04 67 2A 07 05"	= "ملحقات SET";
"06 04 67 2A 07 06"	= "مؤهل SET";

"06 03 67 2A 08"	= "ماركة";
"06 04 67 2A 08 01"		= "IATA-ATA";
"06 04 67 2A 08 04"		= "VISA";
"06 04 67 2A 08 05"		= "MasterCard";
"06 04 67 2A 08 1E"		= "Diners";
"06 04 67 2A 08 22"		= "American Express";
"06 05 67 2A 08 AE 7B"	= "Novus";

"06 03 67 2A 09"	= "البائع";
"06 04 67 2A 09 00"	= "GlobeSet";
"06 04 67 2A 09 01"	= "IBM";
"06 04 67 2A 09 02"	= "CyberCash";
"06 04 67 2A 09 03"	= "Terisa";
"06 04 67 2A 09 04"	= "RSADSI";
"06 04 67 2A 09 05"	= "VeriFone";
"06 04 67 2A 09 06"	= "TrinTech";
"06 04 67 2A 09 07"	= "BankGate";
"06 04 67 2A 09 08"	= "GTE";
"06 04 67 2A 09 09"	= "CompuSource";
"06 04 67 2A 09 0A"	= "Griffin";
"06 04 67 2A 09 0B"	= "Certicom";
"06 04 67 2A 09 0C"	= "OSS";
"06 04 67 2A 09 0D"	= "TenthMountain";
"06 04 67 2A 09 0E"	= "Antares";
"06 04 67 2A 09 0F"	= "ECC";
"06 04 67 2A 09 10"	= "Maithean";
"06 04 67 2A 09 11"	= "Netscape";
"06 04 67 2A 09 12"	= "Verisign";
"06 04 67 2A 09 13"	= "BlueMoney";
"06 04 67 2A 09 14"	= "Lacerte";
"06 04 67 2A 09 15"	= "Fujitsu";
"06 04 67 2A 09 16"	= "eLab";
"06 04 67 2A 09 17"	= "تعهد";
"06 04 67 2A 09 18"	= "VIAnet";
"06 04 67 2A 09 19"	= "III";
"06 04 67 2A 09 1A"	= "OpenMarket";
"06 04 67 2A 09 1B"	= "Lexem";
"06 04 67 2A 09 1C"	= "Intertrader";
"06 04 67 2A 09 1D"	= "Persimmon";
"06 04 67 2A 09 1E"	= "NABLE";
"06 04 67 2A 09 1F"	= "espace-net";
"06 04 67 2A 09 20"	= "Hitachi";
"06 04 67 2A 09 21"	= "Microsoft";
"06 04 67 2A 09 22"	= "NEC";
"06 04 67 2A 09 23"	= "Mitsubishi";
"06 04 67 2A 09 24"	= "NCR";
"06 04 67 2A 09 25"	= "e-COMM";
"06 04 67 2A 09 26"	= "Gemplus";

"06 03 67 2A 0A"	= "وطني";
"06 05 67 2A 0A E2 00"	= "اليابان";

/* Draft SET (deprecated) */

"06 04 86 8D 6F 02"	= "مفتاح جذري مجزّئ";
"06 04 86 8D 6F 03"	= "نوع الشهادة";
"06 04 86 8D 6F 04"	= "بيانات التاجر";
"06 04 86 8D 6F 05"	= "مطلوب بطاقة الشهادة";
"06 04 86 8D 6F 06"	= "النقل";
"06 04 86 8D 6F 07"	= "مؤهل SET";
"06 04 86 8D 6F 63"	= "بيانات SET";

/* Apple */

"06 06 2A 86 48 86 F7 63"		= "Apple";
"06 07 2A 86 48 86 F7 63 64"	= "أمن بيانات Apple";

"06 08 2A 86 48 86 F7 63 64 01" = "معرف سياسة الثقة Apple";
"06 09 2A 86 48 86 F7 63 64 01 01"  = "سياسة Apple iSign";
"06 09 2A 86 48 86 F7 63 64 01 02"  = "السياسة الأساسية Apple X.509";
"06 09 2A 86 48 86 F7 63 64 01 03"  = "سياسة Apple SSL";
"06 09 2A 86 48 86 F7 63 64 01 04"  = "سياسة توليد شهادة Apple المحلية";
"06 09 2A 86 48 86 F7 63 64 01 05"  = "سياسة توليد Apple Local CSR";
"06 09 2A 86 48 86 F7 63 64 01 06"  = "سياسة إلغاء Apple CRL";
"06 09 2A 86 48 86 F7 63 64 01 07"  = "سياسة إلغاء Apple OCSP";
"06 09 2A 86 48 86 F7 63 64 01 08"  = "سياسة Apple S/MIME";
"06 09 2A 86 48 86 F7 63 64 01 09"  = "سياسة مصادقة Apple قابلة للتجديد";
"06 09 2A 86 48 86 F7 63 64 01 0A"  = "سياسة توقيع تحديث برنامج Apple";
"06 09 2A 86 48 86 F7 63 64 01 0B"  = "سياسة Apple IPsec";
"06 09 2A 86 48 86 F7 63 64 01 0C"  = "سياسة Apple iChat";
"06 09 2A 86 48 86 F7 63 64 01 0D"  = "سياسة توقيع مصدر Apple";
"06 09 2A 86 48 86 F7 63 64 01 0E"  = "سياسة عميل Apple Kerberos";
"06 09 2A 86 48 86 F7 63 64 01 0F"  = "سياسة خادم Apple Kerberos";
"06 09 2A 86 48 86 F7 63 64 01 10"  = "سياسة توقيع رمز Apple";
"06 09 2A 86 48 86 F7 63 64 01 11"  = "سياسة توقيع طرد Apple";

"06 08 2A 86 48 86 F7 63 64 02" = "معرف خوارزمية أمن Apple";
"06 09 2A 86 48 86 F7 63 64 02 01"  = "Fast Elliptical Encryption (FEE)";
"06 09 2A 86 48 86 F7 63 64 02 02"  = "Apple Secure Compression (ASC)";
"06 09 2A 86 48 86 F7 63 64 02 03"  = "توقيع FEE مع MD5";
"06 09 2A 86 48 86 F7 63 64 02 04"  = "توقيع FEE مع SHA-1";
"06 09 2A 86 48 86 F7 63 64 02 05"  = "تشفير Apple FEED";
"06 09 2A 86 48 86 F7 63 64 02 06"  = "Apple FEED (تجريبي)";
"06 09 2A 86 48 86 F7 63 64 02 07"  = "توقيع FEE مع ECDSA";

"06 08 2A 86 48 86 F7 63 64 03" = "معرف شهادة Apple .Mac";
"06 09 2A 86 48 86 F7 63 64 03 01"  = "طلب شهادة Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 01"  = "طلب شهادة هوية Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 02"  = "طلب شهادة توقيع بريد Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 03"  = "طلب شهادة تشفير بريد Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 04"  = "طلب قائمة أرشيف Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 05"  = "طلب تخزين أرشيف Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 06"  = "طلب إحضار أرشيف Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 07"  = "طلب إزالة أرشيف Apple .Mac";
"06 09 2A 86 48 86 F7 63 64 03 02"  = "ملحق شهادة Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 02 01"   = "هوية Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 02 02"   = "توقيع بريد Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 02 03"   = "تشفير بريد Apple .Mac";
"06 09 2A 86 48 86 F7 63 64 03 03"  = "قيمة طلب شهادة Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 03 01"  = "اسم المستخدم";
"06 0A 2A 86 48 86 F7 63 64 03 03 02"  = "كلمة السر";
"06 0A 2A 86 48 86 F7 63 64 03 03 03"  = "اسم المضيف";
"06 0A 2A 86 48 86 F7 63 64 03 03 04"  = "علم التجديد";
"06 0A 2A 86 48 86 F7 63 64 03 03 05"  = "علم غير متزامن";

"06 08 2A 86 48 86 F7 63 64 04" = "استعمال المفتاح الممدد Apple";
"06 09 2A 86 48 86 F7 63 64 04 01"  = "توقيع رمز Apple";
"06 0A 2A 86 48 86 F7 63 64 04 01 01"  = "توقيع رمز Apple (تطوير)";
"06 0A 2A 86 48 86 F7 63 64 04 01 02"  = "توقيع تحديث برنامج Apple";
"06 0A 2A 86 48 86 F7 63 64 04 01 03"  = "توقيع رمز Apple (محفوظة)";
"06 0A 2A 86 48 86 F7 63 64 04 01 04"  = "توقيع مصدر Apple";
"06 09 2A 86 48 86 F7 63 64 04 02"  = "توقيع Apple iChat";
"06 09 2A 86 48 86 F7 63 64 04 03"  = "تشفير Apple iChat";
"06 09 2A 86 48 86 F7 63 64 04 04"  = "معرف نظام Apple";

"06 08 2A 86 48 86 F7 63 64 05" = "سياسات شهادة Apple";
"06 09 2A 86 48 86 F7 63 64 05 01"  = "سياسة شهادة Apple";
"06 09 2A 86 48 86 F7 63 64 05 02"  = "سياسة شهادة Apple .Mac";

/* Extended key usage */

"06 04 55 1D 25 03"					= "توقيع الرمز";

/* Intel CDSA-specific */

"06 07 60 86 48 01 86 F8 4D"	= "Intel";
"06 08 60 86 48 01 86 F8 4D 02"	= "أمن Intel CDSA";

"06 09 60 86 48 01 86 F8 4D 02 01"	= "تنسيقات أمن Intel CDSA";
"06 0B 60 86 48 01 86 F8 4D 02 01 01 01"	= "ملحقات شهادة X.509v3";
"06 0C 60 86 48 01 86 F8 4D 02 01 01 01 32"	= "ملحقات الشهادة الخاصة X.509v3";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 01"	= "خارطة ثنائية موضوع التوقيع";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 02"	= "صورة الموضوع";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 03"	= "موضوع عنوان البريد الإلكتروني";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 04"	= "إعفاءات Use";

"06 0A 60 86 48 01 86 F8 4D 02 02 05"	= "خوارزميات أمن Intel CDSA";
"06 0B 60 86 48 01 86 F8 4D 02 02 05 51"	= "SHA-1 مع ECDSA";

/* end */
